nsaspook/mbmc/swm8722/solar18f8722/swm8722.c
// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot Block (000000-007FFF, 000FFF or 001FFFh) not protected from table reads executed in other blocks)

#define	__MBMC_C			//	This is the main program

/*
 * This program controls and monitors solar power battery arrays on a 12vdc system
 * MBMC uses a simple expert machine to try and keep current the energy stored in a bank of batteries
 * The main physics functions are contained in the noload_soc, update_cef, ChargeBatt and pick_batt functions
 * Much more work is needed to make the program flow logical but making it work first is the current effort
 * The network interface processor on a pic32 will be able to analyze the collected data for better control at some future point
 *
 * standard program units:
 * Voltage  in (uint32_t/uint16_t) millivolts,
 * Current in (int32_t) tenths of amps
 * Watts Power in (uint32_t)
 * Ah battery capacity (uint32_t) milliAh when in 32 bit variables/ (int16_t) tenths of Ah when in 16 bit variables for net in/out Ah balance usage h[0],h[6]
 *
 * R: structure, real values from measurements
 * C: structure, calculated values from measurements or programs
 * B: structure, battery parameters
 *
 * USART2 		Is the client comm port 38400
 * USART1		MBMC host network 38400
 * Timer0		1 second clock
 * TImer1		Not used
 * Timer2		Not used
 * Timer3		work thread , background I/O clock ~20HZ
 * TImer4		PWM Period clock

 * 0..11 analog channels are active
 * PORTA		analog inputs
 * adc0	systemvoltage					PIC Controller supply voltage to 5VDC regulator
 * adc1	ccvoltage					Charging voltage at battery from CC
 * adc2	currentin					50A AMPLOC sensor input from PV array
 * adc11		rawp1/inputvoltage		Voltage from PV array
 * adc4			rawp2/primarypower[B1]		Voltage a primary inverter battery
 * PORTB		external control i/o
 * PORTC0		C40 charge controller led input
 * PORTD		switch input
 * PORTE		battery/charge relays
 * PORTF						analog inputs
 * adc5	current					300A AMPLOC sensor battery output to inverter
 * adc6 rawp3/primarypower[B2]	Voltage for backup battery
 * adc8 currentcharger 			50A AMPLOC sensor on 15vdc 22A ps for external charger.
 * adc9 thermo_batt				thermistor input 10K at 25C RF4
 * adc10 Ground REF				zero adc charge cap
 * adc3  PLUS VREF				Using a external REF02AP 5 volt reference IC from TI/BB
 * adc_cal[10-13]				current sensors zero offset stored in eeprom 10=a50, 11=a50c, 12=a300, 14=future
 * cal table 98,123,ADC_NULL,161,119,ADC_NULL,ADC_NULL,ADC_NULL,ADC_NULL with checksum as last data item in adc_cal[]
 * PORTH0		run flasher led onboard.
 * PORTJ		load/input relays
 * PORTG		ESR load relay, Diversion PWM signal
 * 4x20 LCD status panel and led status lights.
 * currentload					The current going the power the inverter or other load.
 *
 *
 * nsaspook@nsaspook.com Copyright 2014
 * Fairview, Oregon
 * MMC-SD card routines from ELM-CHAN,www.captain.at,www.microchipc.com and others
 */

/*
   This program is free software: you can redistribute it and/or modify
   it under the terms of the GNU General Public License as published by
   the Free Software Foundation, either version 3 of the License, or
   (at your option) any later version.

   This program is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU General Public License for more details.

   You should have received a copy of the GNU General Public License
   along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

/*
 *
 * This application is designed for use with the
 * ET-BASE PIC8722 board, 4*20 LCD display and XANTREX C40 charge controller.
 *
 * RS-232 host commands 38400baud 8n1
 * A		send controller/battery status
 * B		select battery for modify commands, used with S M L
 * C		(NOT DONE YET)
 * D		Diversion on
 * d		Diversion off
 * E		When in FAIL-SAVE mode switch to second battery
 * F		Force current (none critical) charge routine to exit
 * G		Toggle GANGED mode  batteries B1@B2 banked mode
 * g 		Calibrate ADC voltages.
 * H		Dump all SD card data records to comm1 port
 * h		Dump last 1000 SD card data records to comm2 port
 * K		lockup controller causing WDT timer to reboot
 * S M L	modify selected battery type, example: ZBBMZ would set battery 2 to M type.
 * T		Tweak setting for active battery on charger
 * V		turn external charger on
 * v		turn external charger off
 * Z		reset command parser
 * ?		Send help menu to rs-232 terminal
 * $		fuse blown error. (NOT DONE YET)
 * ^		reset current sensor zero calibration
 * !		hold program in present date
 * *		set battery on CC to 100% SOC
 * #		display run data on terminal rs-232 port
 * @		display model data on terminal rs-232 port
 * P		SIMULATE PV power on
 * p		SIMULATE PV power off
 * O		SIMULATE PWM 33%
 * o		SIMULATE PWM off
 *
 */


//	***
//  0.2             solar charge monitor software.
//  0.3             add A/D inputs for voltage/current monitor.
//  0.4             program battery switching and charge monitor
//  0.5             interface and data functions
//  0.6             randomize battery charging
//  0.7             load testing solar
//  0.8             load testing battery
//  0.9             battery data collection
//  1.0             basic operation
//  1.1             refine timing and lcd display
//  1.2             DT relays nornally closed power
//  1.3             improve charge logic
//  1.4             display
//  1.5             better battery checks
//  1.6             setup number of batteries
//  1.7             monitor rawp1(cell) rawp2
//  1.8             monitor charging source(s)
//  1.9             fix battery flags and timers
//  2.0             timer0 isr for flasher and time
//  2.1             rs-232 comms
//  2.2             cleanup for first basic release
//  2.3             format LCD output
//  2.4             status report update for all systems
//  2.5             monitor primary battery #1 (primarypower on ad4)
//  2.6             refactor code
//  2.7             more software cleanup with defines
//  2.8             fix cut/paste error     in critical battery section, add auto data logging
//  2.9             current sensor code for AMPLOC AMP300 sensor
//  3.0             change PORTF usage to PORTB, we now use PORTF as analog inputs.
//  3.1             Change host port to com2 so we can use ttl level inputs from CC on port1
//  3.2             Add FORCEOUT host command and code to check for charge controller status on port2
//  3.3             ADC voltage adjustments from host control
//  3.4             start basic battery monitor fuctions using Victron PMB as a model.
//  3.5             C40 LED status linked to program. two routines to monitor the LED. one just checks for solid LED, the other counts blinks
//                  We will check both as a failsafe mode to make sure the battery is charged. The blink monitor also looks for when we are in
//                  ABSORPTION mode and if the C40 in in BULK run mode.
//  3.6             cleanup current monitor and add GPL header.
//  3.7             low isr routines for timer2 and portb to support alarms and history worker thread
//  3.8             monitor backup battery #1 (primarypower[B2] on ad6)
//  3.9             high/low ISR bug fixes and code corrections
//  4.0             reformat datalogging format
//  4.1             Ah/Power/Runtime routines
//  4.2             convert LCD strings for multi use.
//  4.3             Display format and refresh fixes
//  4.4             FAIL-SAFE mode changes for battery equalization
//  4.5             Add the peukert routines for TTG, bug hunt
//  4.6             add digital signal filter, 63/64,3/4 ratios
//  4.7             DEADLOCK hunt
//  4.8             reformat display for 4x20 LCD
//  4.9             SD card datalogger, only works with SDHC cards, SD support is totally fubar
//  5.0             SDHC card support
//  5.1     SD card history, data dump
//  5.2     Improve battery float/charge logic to use several factors to product a total SOC "weight" to decide what to do. higher = better
//  5.3     save controller and battery history to SD card
//  5.4     redo CC and BM state machine code, add power divert
//  5.5     inverter battery sense switch code. (BETA)
//  5.6     fix data corruption bug in sd_dump
//  5.7     save run data to eeprom
//  5.8     current sensor zero routines, tek terminal codes on comm2 (control)
//  5.9     fix usart oerr errors. lockup in tek receive
//  6.0     Use battery monitor SOC at all times unless set to full charge with * command
//  6.1     set CEF from real battery SOC not derated capacity
//  6.2     keep CC in float as long as possible
//  6.3     serial control port command and bug fixed
//  6.4     Stop using timer1 and only have timer0 and timer2  1HZ 153HZ
//  6.5     Move back to timer1 at 50Hz and timer0 at 1hz
//  6.6     change default discharge to a daily event instead with setting for batts 1@2 AH_DAY_LOSS*
//  6.7     add drate to hist to adjust Ah rate when battery real Ahs seems different.
//  6.8     add runtime and error text for terminal display, add CCS.bn and CCS.alert logic to force battery selection and charging
//  6.9     rework code for fewer irq locks
//  7.0     add profile code with hirez_count[6]: 0=time in high isr, 1=time in low isr, 2= temp work var
//  7.1     code and display bug hunt
//  7.2     buffer overflow and switching bug hunt
//  7.3     stackover flow problems from floating point calcs, place critical flags around or simplify
//  7.4     Lots of global vars in use to reduce stack errors
//  8.0     Start using Peukert adjusted amps for SOC
//  8.1     fix Ah bug
//  8.2     fix high isr lockout bug
//  8.3     Fix idle loop wdt timeout
//  9.0     start host interface code for PIC32 rs-232 to ethernet web interface
//  9.1     Use GenericTypeDefs for compat with PIC32, add mbmc.h to share data with host code
//  9.2     Basic mbmc serial network connection and command API
//  9.3-9.5 network code changes
//  9.6     lp-filter fixes
//  9.7-10.0		Mainly MBMC web page routines and displays
//  10.0-10.3		Network code and ADC improvements (adc10 is grounded and used to discharge adc charge cap between measurements)
//  10.4    Correct errors in battery Ah in/out balance accounting (work_handler thread)
//  10.5    increase Hall Sensor samples to capture several PWM cycles
//  10.6    fix stupid worker thread time error. it was running at 11 seconds instead of 10. fix charger override deadlock in pick-batt
//  21.1    Power glitch and unstable code, move from timer1 to timer3 because of erata
//  21.6    Fix port B errors caused by not including openxlcd.c. it defaults to B for I/O in the C18 library version
//  21.7    Add a T command to change mainly Ah runtime data
//  22.0    A true Beta version, fix sd_dump to use correct rs-232 port
//  22.1    modify model for cap recovery and other factors
//  22.2    add battery model type data structures for better SOC matching
//  22.5    add xlcd files in package. Add code to allow optimization and still have correct program flow.
//  22.6    External Charger fixups, AC monitor code cleanup and additions, LCD VC code fixes, Rest Reserve Recovery simple model
//  22.7    Fix mbmc cell data transfer, add battery 1&2 current monitor code, add framework for diversion PWM control
//  22.8    minor dead battery error and esr calc fixes, start to split the source file, use interrupt driven xmit for the host link
//  22.9    Remove the battstatus 512 byte array and use sdbuffer instead, reworked the linker and variables to fix bank optimization.
//  23.0    Fix buffer overflow bug int16_t bootstr2 printing. Improve PWM and add ABSORPTION time adjustments, code refactor
//  23.1    Update SDCARD data format
//  23.2    Add a telnet server app on the PIC32 host that talks to the RS-232 terminal comm port, User: mbmc Password: mbmc
//  23.4    Add data to mbmcdata structure for chart data
//  23.5    Bug fixes to the BSOC and usages
//  23.7    Keep track of total power in and out of each battery, bug fixes
//  23.8    Allow Batteries 1&2 to operate GANGED mode, fix EEPROM cal data bug
//  23.9    Refactor variable names and type structures
//  24.0    change vars to stdint types
//  24.4    Fix a huge amount of runtime bugs
//  24.5-6  Add sunlight quality checking for DIVERSION FLAG
//  24.7    Add End-Amps factor for extended absorption timing
//  24.8    Rework static SOC code for better matching of the battery SOC to VOLTAGE
//  24.9    Store and display both SOC method results for skew, fix end_amps bug, add SOC codes U,S,M,F,R,L
//  25.0    Update SD data format and fix index bugs, pick_batt fixes
//  25.2    Move some routines from the main into modules
//  25.3    Use a external VREF 5.0v on ana3, move old an3 input to ana11, change OpenADC config
//	    This is a hardware change that should improve measurements
//  25.4    Fix kwi/kwo accounting
//  25.5    Start setting up the foundation for using ESR in SOC calc's
//  25.6    Fix some of the ESR routines and add data for esrp in data logging
//  25.7    Change the data logging format to make it easier to track variables.
//  25.8-9  Add more bad battery detection
//  26.0    Software fixes and cleanups
//  26.1    Fixups for gell-cell current limiters, add GELL_R_COMP and GELL_ESR_COMP defines
//  26.2    Start moving all the flags into structures.
//  26.3    Add fresh data flag for remote data monitor and increase update rate while in charging modes
//  26.4    Fix B_GANGED bug in daq.c
//  30.0    New fixes branch
//  30.1    Use AGM cells for controller power so change 'S' to 'M'
//  30.4    Fix accounting bug on battery 3
//  40.0    New development branch
//  40.1    Lots of global variables but embedded C is one trick monkey
//  40.2    Dual charging of controller batteries and ganged fixes
//  40.3    get local time, equalization function and full charge count fixes
//  40.5    SD card updates
//  40.6    adjust battery weight by DOD >100
//  40.9    reduce number of static vars in routines and add diags to SD card failures
//  41.0    Adjust Peukert factors for AGM batteries
//  50.0    adjust for LIPO4 type cells
//	***
//  dipswitch settings PORTD
//  1       on=reset battery charging counters and flags
//  2       on=2 batteries/off=4 batteries to monitor
//  3       on=Force inverter to primary battery in software
//  4       on=turn on external charge power when needed
//  5       on= Enable GANGED B1 and B2
//  6       on=FAIL-SAFE MODE, just connect C40 to PRIMARY BATTERY
//  7       on=disenable DIVERSION control of excess power when battery on charger is full
//  8       on=Force DIVERSION on
//	***

