nsaspook/mbmc/swm8722/solar18f8722/swm8722.c
#include <p18cxxx.h>
#include <delays.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include <math.h>

#include "mbmc_defs.h"
#include "xlcd.h"
#include "config.h"
#include "mbmc.h"
#include "crit.h"
#include "sdspi.h"
#include "mbmc_msg.h"
#include "hwconf.h"
#include "power.h"
#include "model.h"
#include "mbmc_vector.h"
#include "mbmc_shared.h"
#include "daq.h"
#include "timelib.h"

void clr_lcd(void);
int8_t *ahfp(int32_t, int8_t *);
int8_t *voltfp(uint32_t, int8_t *);
int8_t *voltfps(uint32_t, int8_t *);
int8_t *voltfpi(int32_t, int8_t *);
void noload_soc(void);
void fail_safe(void);
int8_t *hms(uint32_t);
int8_t *hm(uint32_t);
float lp_filter(float, int16_t, int16_t);
int16_t sd_dump(int16_t); // send SD card data to comm1 port
int16_t W_SDC0_EEP(uint16_t); // EEPROM save routine
void putc2(uint8_t c);
void set_batt_type(void); // set the battery type
void set_tweak(void); // tweak run time parameters
void set_ganged(void); // modify ganged mode
void hold_process(void); // hold monitor progrsm
void sync_battsoc(void); // set BOC to 100% SOC
void system_data(void); // send system variables to rs-232 terminal
void system_help(void); // send system help menu to rs-232 terminal
void display_system(void); // send adc values to terminal
void mbmc_update(void); // load data into MBMC buffer
void mkbsstring(void); // create data buffer for SD card and network
uint8_t check_alarm(uint8_t, const rom int8_t*);
int32_t ABSL(int32_t);
int16_t ABSI(int16_t);
void LCD_VC_puts(uint8_t, uint8_t, uint8_t);
float update_cef(uint8_t, uint8_t);
uint32_t peukert(uint16_t, float, float, int16_t, uint8_t);
void wdttime(uint32_t);
void wdtdelay(uint32_t);
void update_hist(void);
void term_time(void);
uint16_t Volts_to_SOC(uint32_t, uint8_t);
uint16_t Get_RestSOC(uint8_t, uint8_t, blendmode_t);
void init_hist_data(void);
void ChargeRelayOn(uint8_t, uint8_t);
void ChargeRelayOff(uint8_t, uint8_t);

const rom uint32_t BVSOC_TABLE[BVSOC_SLOTS][2] = {
	11500, 5,
	11700, 10,
	11800, 20,
	12060, 25,
	12100, 30,
	12220, 40,
	12270, 45,
	12300, 50,
	12323, 53,
	12350, 55,
	12375, 57,
	12400, 60,
	12425, 63,
	12475, 67,
	12500, 70,
	12510, 72,
	12520, 75,
	12525, 80,
	12530, 85,
	12540, 90,
	12548, 92,
	12561, 93,
	12570, 95,
	12580, 97,
	12590, 100,
	13100, 90
};

// section just for the large arrays idata
#pragma	idata	bigdata
far int8_t block_buffer[SDBUFFERSIZE + SDBUFFER_EXTRA] = {0};
far int8_t bootstr2[MESG_W + 1] = {0};
uint8_t csd[SD_18] = {0}, cid[SD_18] = {0}, HCRIT[CRIT_8] = {0}, LCRIT[CRIT_8] = {0};
int8_t p1[C_TEMP16] = {0}, p2[C_TEMP16] = {0};
int8_t termstr[32] = {0}, CCM = 'O';
volatile struct celltype cell[DATA_SLOTS] = {0}, *mbmccell; // data array for each battery cell
far int8_t f1[C_TEMP7] = {0}, f2[C_TEMP7] = {0}, f3[C_TEMP7] = {0}, f4[C_TEMP7] = {0};
int8_t p3[C_TEMP16] = {0};
volatile struct buttype buth[BUTH_SLOTS] = {0}; // data array for each battery history data / hour
volatile struct almbuffertype alarm_buffer[MAXALM] = {0};
float smooth[LPCHANC] = {0}, esr_delta;
volatile struct histtype hist[DATA_SLOTS] = {0};
struct lcdb ds[VS_SLOTS] = "Fred Brooks"; //  LCD display string, name
struct battmodeltype bmt[HISTBATTNUM] = {0};

#pragma idata gpr13
far int8_t hms_string[16] = {0};
volatile int16_t venttimer = VENTTIME, loggertime = LOGGERTIME;
int16_t a50 = 0, a300 = 0, a50c = 0, therm = 0, worktick = 0, cef = 0, cef_calc = 0, cef_save = 0, sdret = 0, sderr = 0;

volatile struct P_data P = {TRUE, FALSE, TRUE, FALSE, FALSE, FALSE, FALSE, FALSE, FALSE, FALSE, FALSE, FALSE, FALSE, FALSE, FALSE, FALSE, TRUE, TRUE, TRUE, TRUE,
	FALSE, FALSE, FALSE, FALSE, FALSE, FALSE};

// BCHECK = TRUE, TIMERFLAG = FALSE,  PRIPOWEROK = TRUE,FORCEOUT = FALSE, ,WORKERFLAG = FALSE CHARGEROVERRIDE = FALSE, FAILSAFE = FALSE,
//  MORNING_HELP = FALSE, SYSTEM_STABLE = FALSE, HOLD_PROC = FALSE, POWER_UNSTABLE = FALSE,  SET_BATT = FALSE,, BLANK_LCD = FALSE
// STATIC_SOC = TRUE,  SET_CEF = TRUE, D_UPDATE = TRUE, GLITCH_CHECK = TRUE,
//         FORCEDAY = FALSE, COOLING = FALSE,
//	UPDATE_EEP = FALSE, RESET_ZEROS = FALSE,
volatile uint8_t
SYS_DATA = FALSE, MOD_DATA = FALSE, SYS_HELP = FALSE, SET_ADC = FALSE,
	WDT_TO = FALSE, EEP_ER = FALSE, PERKOSW_R = FALSE, TWEAK = FALSE, GANGED_MODE = FALSE, XON_XOFF = FALSE, DISPLAY_MODE = FALSE, GANG_OVERRIDE = FALSE;

volatile uint8_t battnum = MAXBATT, critc_level = 0, keynum = 0, b_read = 0,
	c2raw = 0, glitch_count = 0, fast_ticks = FT20, real_ticks = 0, cdelay = 0, SIM_MODE = RUNSIM, SIM_FLAG = 0;

volatile struct almtype alarm_codes = {FALSE, 0};
volatile uint8_t almctr = 0;
union Timers hirez_0 = 0, hirez_1 = 0;
volatile uint32_t display_count = 0,
	status_count = 0, cctimer = CCLEDTIME,
	dayclockup = 0, dayclockdown = 0, worker_count = 0, critc_count = 0, d_on = 0, d_off = 0,
	c_on = 0, c_off = 0, dayclocklocal = 0;

#pragma idata gpr3
volatile uint8_t HOST_BUSY = FALSE, HOST_COMM = FALSE;
volatile SDCARD_TYPE SDC0 = {MAGIC, 0, FALSE, FALSE, 2, 2}; // active program SD buffer
volatile SDDUMP_TYPE SDD0 = {FALSE, ' ', 0};
volatile struct ccledtype ccled_flag = {OFF, 0, CCLEDBLINK, 0, FALSE};
int8_t sign = ' ';
float lp_speed = 0.0, lp_x = 0.0;
volatile struct mbmclinktype LINK = {TRUE, TRUE};

#pragma idata gpr15
struct R_data R = {0};
struct C_data C = {0};
volatile struct B_data B = {0};
volatile struct V_data V = {0};
const rom int8_t *build_date = __DATE__, *build_time = __TIME__;
VOLUME_INFO_TYPE MMC_volume_Info = {0}, *vinf = 0;
volatile uint16_t solarup_delay = 0;
uint16_t zero_ref = 0, max_eeprom_data = 1024;
volatile uint32_t utctime = 0, localtime = 0;

volatile union {
	uint32_t netdword;
	uint8_t netdbyte[4];
} netd;
volatile int32_t time_skew_base = 0, time_skew = 0;
volatile uint8_t dsi = 0, dead_times = 0; //      LCD display string index to console 0

#pragma idata gpr4
volatile struct mbmcdata MBMC = {0};
volatile struct mbmcflagtype mbmcflag = {0}, mbmc_dumpflag = {0};
float t1 = 0.0, t2 = 0.0, t3 = 0.0, t4 = 0.0, t5 = 0.0, t6 = 0.0, t7 = 0.0, t_time = 0.0;

#pragma idata gpr0
volatile int16_t tx_tmp = 0, rx_tmp = 0;
volatile uint32_t mbmc_cmd_reply = 0;
float voltfrak = 0.0;
float ahfrak = 0.0;
volatile int32_t ahi_tmp = 0, aho_tmp = 0, ahop_tmp = 0, absorp_current = 0, end_amps = 0;
uint8_t model_update = MODEL_UPDATE;
int32_t current_t = 0, currentin_t = 0, currentcharger_t = 0;
uint32_t chrg_v = 0;
volatile struct battbufftype battbuffer = {0}, batttype = {0};
volatile uint8_t idleflag = FALSE;
volatile int16_t CCEFF = 99, CCEFF_DIFF = 0; // 99% of max power
int32_t iw = 0, ip = 0;
struct SDCARD sdc0b1 = {0}; // SD buffer for loading and dumping SD data
volatile uint8_t B0 = B0B, B1 = B1B, B2 = B2B, B3 = B3B, B4 = B4B, B_GANGED = FALSE;

#pragma idata
volatile uint8_t UTC_flag = 0, UTC_ok = 0, DIVERSION_set = FALSE;
volatile uint8_t *netdword_ptr = 0, netdword_pos = 0;
volatile struct ccstype CCS = {0};
volatile uint16_t hirez_count[7] = {0, 0, 0, 0, 0, 0, 0};
/* ADC voltage/current default calibration values , adjusted with D command */
// adc_cal[10-13]				current sensors zero offset stored in eeprom 10=a50, 11=a50c, 12=a300, 13=future
uint8_t adc_cal[] = {125, 152, 106, 199, 146, 114, 171, ADC_NULL, ADC_NULL, ADC_NULL, 123, ADC_NULL, 118, ADC_NULL, 0};
// voltage/current value calibration: 0=system voltage, 1=CC voltage, 2=PV current, 3=PV voltage, 4=B1, 5=Battery current, 6=B2
uint8_t CRITC = 0, BOOT_STATUS = 0;
int8_t soc_method[DATA_SLOTS] = {'U', 'U', 'U', 'S', 'S'};
struct tm local_tm;
uint32_t vsoc[DATA_SLOTS] = {0}; // store adjusted battery voltage used to calc SOC
volatile union Alarm alarms;

