nsaspook/mbmc/swm8722/solar18f8722/swm8722.c
volatile enum ccmode_t {
	IDLE_M, BULK_M, FLOAT_M, TEST_M, ABSORP_M, FLOAT_W
} CCMODE;

volatile enum mbmode_t {
	IDLE_M, CHARGE_M, FLOAT_M, TEST_M
} BMMODE;

volatile enum answer_t {
	WAIT_M, YES_M, NO_M
} YNKEY;

blendmode_t BLENDMODE = NO_BLEND;

/* ISR vectors */
#pragma code tick_interrupt = HIGH_VECTOR

void tick_int(void)
{
	_asm goto tick_handler _endasm // high
}
#pragma code

#pragma code work_interrupt = LOW_VECTOR

void work_int(void)
{
	_asm goto work_handler _endasm // low
}
#pragma code

/* Current is in 0.1A units */
uint32_t peukert(uint16_t brate, float bcurrent, float peukert, int16_t bsoc, uint8_t battn)
{
	if (battn > HISTBATTNUM) return 1.25;
	t1 = (float) bcurrent; // Load on battery in 0.1A units
	t1 /= 10.0; // convert back to A
	if (t1 < 1.0) t1 = 1.0; // inverter current floor is 1.0 amp
	t2 = (float) brate; // Battery capacity in 1.0A units
	t3 = (float) ((float) bsoc / 100.0); // State of Charge
	if (t3 > 0.0) t2 = t2 * t3; // only decrease battery Ah
	if (t2 < 1.0) t2 = 1.0; // Ah floor is 1.0
	t4 = t2 * (float) (pow((t2 / (float) 20.0), ((float) peukert - (float) 1.0)));
	t_time = pow((t2 / (float) 20.0), peukert); // factor at 20h rate
	t5 = pow(t1, peukert); // factor at load current rate
	t6 = t4 / t5; // runtime in hours at the current draw
	if (t6 > MAXRUNTIME) t6 = MAXRUNTIME; // max time is 4 days in hours
	if (t6 < MINRUNTIME) t6 = MINRUNTIME;
	t7 = t4 / t_time; // time at fixed 20h rate
	s_crit(HL);
	hist[battn].peukert_adj = t7 / t6; // Peukert factor to resize Ah usage, t7=runtime at the 20h current rate/t6=runtime at the inverter load current value
	if (hist[battn].peukert_adj < Perk_ADJ_FL)
		hist[battn].peukert_adj = Perk_ADJ_FL; // limit how LOW
	if (hist[battn].peukert_adj > Perk_ADJ_FH)
		hist[battn].peukert_adj = Perk_ADJ_FH; // limit how HIGH
	e_crit();
	t6 = lp_filter(t6, LP_PEUKERT + battn, FALSE); // digital filter for each battn
	t6 = t6 * 3600.0; // convert to seconds for runtime at current discharge rate
	return(uint32_t) t6;
}

void LCD_VC_puts(uint8_t console, uint8_t line, uint8_t COPY) // VCx,DSx, [TRUE..FALSE} copy data from bootstr2 string
{ // into the LCD display buffer
	static uint8_t ib = 0;

	if (COPY) {
		ib = console + line; // set to string index to store data in LCD message array ds[x].b
		strncpypgm2ram(ds[ib].b, "                        ", LCD_W); // write 20 space chars
		strncpy(ds[ib].b, bootstr2, LCD_W); // move data from static buffer in lcd message array
		ds[ib].b[LCD_W] = NULL0; // make sure we have a string terminator
	}

	switch (line) {
	case DS0:
		SetDDRamAddr(LL1); // move to  line
		break;
	case DS1:
		SetDDRamAddr(LL2); // move to  line
		break;
	case DS2:
		SetDDRamAddr(LL3); // move to  line
		break;
	case DS3:
		SetDDRamAddr(LL4); // move to  line
		break;
	default:
		SetDDRamAddr(LL1); // move to  line 1 of out of range
		break;
	}
	ib = dsi + line; // set to string index to display on LCD, dsi is the current VC being displayed

	if (!P.D_UPDATE)
		return;
	if (P.BLANK_LCD)
		clr_lcd();
	while (BusyXLCD());
	putsXLCD(ds[ib].b);
	while (BusyXLCD());
}

void update_hist(void) // compute the runtime data from current data
{
	static uint8_t z = 0;
	static float fcurrent = 0.0;
	static uint32_t ttg_t = 0;

	if (!P.SYSTEM_STABLE) return;
	noload_soc();
	check_alarm(CCS.boc, " update_hist1 ");

	for (z = 1; z <= HISTBATTNUM; z++) { // find a approx run-time at current load on each cell
		if (cell[z].current > 0) {
			fcurrent = (float) cell[z].current + (float) DCURRENT; // battery is supplying current
		} else {
			fcurrent = (float) DCURRENT; // default current for controller power
		}

		ttg_t = peukert((uint16_t) hist[z].rate, fcurrent, hist[z].peukert, hist[z].bsoc, z); // Reduce the total Ah by SOC
		hist[z].ttg = (int32_t) ((float) ttg_t * DF);
		if (hist[z].ahop > (hist[z].ah * 1000l)) hist[z].ahop = hist[z].ah * 1000l; // limit the max ahop to max battery capacity
	}

	voltfp(R.primarypower[B1], f1);
	voltfp(R.primarypower[B2], f2);
	ahfp(hist[B1].h[0], f3); // display pf amps
	sprintf(bootstr2, "%5s %5s %u %s %i     ", f1, hm(hist[B1].ttg), hist[B1].bsoc, f3, cell[B1].online); // B1 status
	LCD_VC_puts(VC0, DS2, YES);
	ahfp(hist[B2].h[0], f3); // display pf amps
	if (!B_GANGED) {
		sprintf(bootstr2, "%5s %5s %u %s %i     ", f2, hm(hist[B2].ttg), hist[B2].bsoc, f3, cell[B2].online); // B2 status
	} else {
		sprintf(bootstr2, "%5s B2&B1 GANGED           ", f2); // B2 status
	}
	LCD_VC_puts(VC0, DS3, YES);

	// check FLAGS from the tick ISR and run subroutine if needed
	if (SDD0.dumping) { // dump history data from the SD Card
		sd_dump(0);
	}

	if (P.UPDATE_EEP) { // save system date to internal eeprom
		W_SDC0_EEP(SDC0EEP); // mirror SDC0 data to eep at address
		P.UPDATE_EEP = FALSE;
	}
	if (P.RESET_ZEROS) { // zero the current sensors
		zero_amploc();
		P.RESET_ZEROS = FALSE;
	}
	if (SET_ADC) { // Set gains for ADC channel calibration
		set_adc_gain();
		SET_ADC = FALSE;
	}
	if (TWEAK) { // Adjust runtime data
		set_tweak();
		TWEAK = FALSE;
	}
	if (GANGED_MODE) { // Adjust Ganged mode
		set_ganged();
		GANGED_MODE = FALSE;
	}
	if (P.SET_BATT) { // Set battery size types
		set_batt_type();
		P.SET_BATT = FALSE;
	}
	if (P.HOLD_PROC) { // Hold processing, mainly used during a battery EQ cycle.
		hold_process();
		P.HOLD_PROC = FALSE;
	}
	if (P.SETBATT_SOC) { // Set SOC/BSOC to battery being charged to 100%
		sync_battsoc();
		P.SETBATT_SOC = FALSE;
	}
	if (SYS_DATA) { // display System data on rs-232 port
		system_data();
		SYS_DATA = FALSE;
	}
	if (MOD_DATA) { // display System data on rs-232 port
		model_data();
		MOD_DATA = FALSE;
	}
	if (SYS_HELP) { // Command Help message
		system_help();
		SYS_HELP = FALSE;
	}
}

/* ISR code moved to mbmc_vector.c */


void wdtdelay(uint32_t delay)
{
	static uint32_t dcount;

	for (dcount = 0; dcount <= delay; dcount++) { // delay a bit
		Nop();
		ClrWdt(); // reset the WDT timer
	};
}

