nsaspook/mbmc/swm8722/solar18f8722/swm8722.c
void wdttime(uint32_t delay) // delay = ~ .1 seconds
{
	static uint32_t dcount, timetemp, clocks_hz;

	s_crit(HL);
	dcount = V.clock50;
	e_crit();
	clocks_hz = dcount + delay + delay; // number of low int16_t clock ticks per second is about 20

	do { // wait until delay
		s_crit(HL);
		timetemp = V.clock50;
		e_crit();
		ClrWdt();
		LCD_VC_puts(dsi, DS0, NO);
		LCD_VC_puts(dsi, DS1, NO);
		LCD_VC_puts(dsi, DS2, NO);
		LCD_VC_puts(dsi, DS3, NO);
		idle_loop();
	} while (timetemp < clocks_hz);
}

void DelayFor18TCY(void)
{
	static uint8_t n;
	for (n = 0; n < 24; n++) Nop(); // works at 200
}

//------------------------------------------

void DelayPORXLCD(void) // works with 15
{
	Delay10KTCYx(15); // Delay of 15ms
	return;
}

//------------------------------------------

void DelayXLCD(void) // works with 5
{
	Delay10KTCYx(5); // Delay of 5ms
	return;
}

void putc2(uint8_t c)
{
	while (Busy2USART()) {
	}; // wait until the usart is clear
	putc2USART(c);
}

void start_delay(void)
{
	wdttime(BATRUNF); // wait for .5 seconds.
}

void clr_lcd()
{
	if (!P.D_UPDATE) return;
	while (BusyXLCD());
}

/*	lp_filters
	0	PWM
	1	CCEFF
	2	solar buffer (overvolt errors)
	3	current
	4	currentin
	5	currentcharger
	6	t6 peukert B0
	7	t6 peukert B1
	8	t6 peukert B2
 *	9	PV inputvoltage
 */
float lp_filter(float new, int16_t bn, int16_t slow) // low pass filter, slow rate of change for new, LPCHANC channels, slow/fast select (-1) to zero channel
{
	// smooth,lp_speed,lp_x is a udata global array to save stack space

	if ((bn >= LPCHANC) || (bn < 0)) // end of the filter array so just return passed value
		return new;
	if (slow) {
		lp_speed = 0.06;
	} else {
		lp_speed = 0.125;
	}
	lp_x = ((smooth[bn]*100.0) + (((new * 100.0)-(smooth[bn]*100.0)) * lp_speed)) / 100.0;
	smooth[bn] = lp_x;
	if (slow == (-1)) { // reset and return zero
		lp_x = 0.0;
		smooth[bn] = 0.0;
	}
	return lp_x;
}

void term_time(void) // sent internal time to rs-232 terminal
{

	ClrWdt(); // reset the WDT timer
	sprintf(termstr, " CT-%s", hms(V.timerint_count));
	puts2USART(termstr);
	sprintf(termstr, " CU-%s", hms(dayclockup));
	puts2USART(termstr);
	sprintf(termstr, " CD-%s", hms(dayclockdown));
	puts2USART(termstr);
}

void hold_process(void) // hold the monitor in the current status until released.
{
	term_time();
	putrs2USART(hold0);
	YNKEY = WAIT_M;
	while (YNKEY == WAIT_M) {
		wdtdelay(10);
		//		ADC_read();
		mkbsstring();
		idle_loop();
		noload_soc();
	}
	if (YNKEY == NO_M) {
		term_time();
		putrs2USART(hold1);
		return;
	}
	term_time();
	putrs2USART(hold1);
}

void system_data(void) // display system data on terminal
{
	static uint8_t z;
	static int32_t q1, q2;

	ClrWdt(); // reset the WDT timer
	pick_batt(0, 0);
	sprintf(bootstr2, "\r\n");
	puts2USART(bootstr2);
	term_time();
	if (SIM_MODE) {
		putrs2USART(SIMULA);
	}
	putrs2USART(" FW ");
	strcpypgm2ram(bootstr2, build_time);
	puts2USART(bootstr2);
	putrs2USART(" ");
	strcpypgm2ram(bootstr2, build_date);
	puts2USART(bootstr2);
	strcpypgm2ram(bootstr2, MBMC_VERSION);
	puts2USART(bootstr2);
	offtime(&local_tm, utctime, 0);
	asctime(&local_tm, bootstr2, 0);
	puts2USART(bootstr2);
	sprintf(bootstr2,
		"GMT, Boot Code %i\r\n Controller Status:\r\n SD time %lu, SD records %lu, SD status %d:%d, Power status 1=OK %u, Config DIPSW %u%u%u%u%u%u%u%u lsb, Temp Raw %i, Temp Sensor %lu, Temp Offset %li, Ah Temp Comp %i",
		(int16_t) BOOT_STATUS, SDC0.timekeep, SDC0.sdpos, sdret, sderr, P.PRIPOWEROK, DIPSW8, DIPSW7, DIPSW6, DIPSW5, DIPSW4, DIPSW3, DIPSW2, DIPSW1, therm, R.thermo_batt, R.thermo_batt - Temp_ZERO, C.temp_drate);
	puts2USART(bootstr2);
	sprintf(bootstr2,
		"\r\n UTC counter %lu, Time Skew %li, Highint %lu, Lowint %lu, Timerint %lu, Workerint %lu, \r\n Com1rx INT %lu, Com1tx INT %lu, Com2int %lu, Bint %lu, PWMint %lu, Eint %lu, Aint %lu, Lowclocks %lu, Lowruns/S %lu,\r\n",
		utctime, time_skew, V.highint_count, V.lowint_count, V.timerint_count, worker_count, V.c1rx_int, V.c1tx_int, V.c2_int, V.buttonint_count, V.pwm4int_count, V.eeprom_count, V.adc_count, V.clock50, V.clock50 / V.timerint_count);
	puts2USART(bootstr2);
	sprintf(bootstr2, " %c,%c,%c,%c, CHARGER %u, H%u,L%u,B%u CRITC levels %u, CRITIC counts %lu, CCLED counts %u, ADC Zero Offset %u\r\n",
		cell[B1].id, cell[B2].id, cell[B3].id, cell[B4].id, CHARGERL, hirez_count[0], hirez_count[1], hirez_count[4], critc_level, critc_count, ccled_flag.ticks, zero_ref);
	puts2USART(bootstr2);
	sprintf(bootstr2, " CCS status: pick %u, boi %u, boc %u, alert %u, bn %u : MBMC network  %u, MBMC Data Bytes %lu, Tx CPS: %li, Rx CPS: %li",
		CCS.pick, CCS.boi, CCS.boc, CCS.alert, CCS.bn, mbmcflag.cmd_timeout ? 0 : 1, V.mbmcdata_count, LINK.tx_cps, LINK.rx_cps);
	puts2USART(bootstr2);
	sprintf(bootstr2, "\r\n System Status:\r\n PV Voltage %lumV, Charging Voltage %lumV, Controller Voltage %lumV, Charge Cycle Time Left %s, Absorp Current %li00mA, End-Amps %li00mA",
		R.inputvoltage, R.ccvoltage, R.systemvoltage, hm(B.charge_time_left), ABSL(absorp_current), end_amps);
	puts2USART(bootstr2);
	sprintf(bootstr2, "\r\n PV Current sensor %li00mA, Inverter Battery Current sensor %li00mA, Inverter Load Current %li00mA, Current Power IN %liW, OUT %liW\r\n AC PWR Inverter %i, Utility %i, Glitch Count %i: ",
		R.currentin, R.current, C.currentload, (R.currentin * R.inputvoltage) / 10000, (R.primarypower[CCS.boi] * C.currentload) / 10000, AC_OFF_I, AC_OFF_U, glitch_count);
	puts2USART(bootstr2);
	if (AC_OFF_U || AC_OFF_I) {
		if (AC_OFF_I) putrs2USART(" \x1b[7m Inverter Power is OFF \x1b[0m,"); // ANSI escape codes (REVERSE)
		if (AC_OFF_U) putrs2USART(" \x1b[7m Utility  Power is OFF \x1b[0m,");
	}
	if (DIPSW3) putrs2USART(" Inverter Battery 1 only: DIPSW3,");
	if (B_GANGED) putrs2USART(" \x1b[7mStrings 1&2 are GANGED\x1b[0m,");
	if (!DIPSW7) putrs2USART(" Power Diversion enabled: DIPSW7,");
	if (DIVERSION) {
		sprintf(bootstr2, " Diversion Status Off: PWM %i%%\r\n Todays Power Q level: %i, Yesterdays Power Q level: %i", (int16_t) MBMC.diversion.power,
			(int16_t) B.today, (int16_t) B.yesterday);
	} else {
		sprintf(bootstr2, " \x1b[7mDiversion Status On\x1b[0m: PWM %i%%\r\n Todays Power Q level: %i, Yesterdays Power Q level: %i", (int16_t) MBMC.diversion.power,
			(int16_t) B.today, (int16_t) B.yesterday);
	}
	puts2USART(bootstr2);
	sprintf(bootstr2,
		"\r\n Total Charger Energy %liWh, Todays Charger energy %liWh, Prev Charger Energy %liWh, Diversion Energy: Total %liWh, Todays %liWh",
		SDC0.harvest.c_total / 1000, SDC0.harvest.charger / 1000, SDC0.harvest.prev_charger / 1000, SDC0.harvest.diversion / 1000, B.diversion / 1000);
	puts2USART(bootstr2);
	ClrWdt(); // reset the WDT timer
	sprintf(bootstr2,
		"\r\n Total PV Energy %liWh, Todays PV energy %liWh, Prev PV Energy %liWh, Total Usage %liWh, Todays Usage %liWh, Dayclock %u:",
		SDC0.harvest.e_total / 1000, SDC0.harvest.energy / 1000, SDC0.harvest.prev_energy / 1000, SDC0.harvest.u_total / 1000, SDC0.harvest.usage / 1000, SDC0.DAYCLOCK);
	puts2USART(bootstr2);
	q1 = (hist[B1].kwo * 100) / hist[B1].kwi;
	if (B_GANGED) {
		q2 = 0;
	} else {
		q2 = (hist[B2].kwo * 100) / hist[B2].kwi;
	}
	sprintf(bootstr2,
		"\r\n Battery Status:\r\n Battery 1 Voltage %lumV, Current %li00mA, Power %liW, Quality %li : Battery 2 Voltage %lumV, Current %li00mA, Power %liW, Quality %li, Water %s,",
		R.primarypower[B1], cell[B1].current, ((int32_t) R.primarypower[B1] * (int32_t) cell[B1].current) / 10000l, q1,
		R.primarypower[B2], cell[B2].current, ((int32_t) R.primarypower[B2] * (int32_t) cell[B2].current) / 10000l, q2,
		hm(B.watercounter - B.watercounter_prev));
	puts2USART(bootstr2);
	putrs2USART(BATTERY_CHANGE);
	ClrWdt(); // reset the WDT timer

