nsaspook/mbmc/swm8722/solar18f8722/swm8722.c
	for (z = 1; z <= battnum; z++) { // create
		if ((z == B2) && B_GANGED) {
			sprintf(bootstr2, "%2i,  \x1b[7mGANGED to B1\x1b[0m \n\r", z);
		} else {
			voltfp((int32_t) (hist[z].peukert_adj * (float) 1000.0), f1);
			sprintf(bootstr2,
				"%2i,%i%i,%6li,%6li,%6li,%5i,%7li,%7li,%7li,%7li,%7li",
				z, cell[z].cconline, cell[z].online, cell[z].noload,
				cell[z].voltage, vsoc[z], hist[z].rate, hist[z].ahir, hist[z].ahi, hist[z].aho, hist[z].kwi / 10000l, hist[z].kwo / 10000l);
			puts2USART(bootstr2);
			sprintf(bootstr2,
				",%4d,%4d%c,%4d,%8li,%6lu,%6u,%6u  Pk Adj %6s, Ahop %6li, Rest Rate %6u, CYCLES %s\n\r",
				hist[z].udod, hist[z].bsoc, soc_method[z], B.r_soc[z], hist[z].ttg,
				(uint32_t) cell[z].weight, hist[z].esr, hist[z].h[10], f1, hist[z].ahop, hist[z].rest_rate, hm(cell[z].cycles));
		}
		puts2USART(bootstr2);
		ClrWdt(); // reset the WDT timer
	}
	putrs2USART(battheader0);

	/*		hist[x].h[x]
	 *		h0	Peukert Factor adjusted Ah usage this cycle 			MUST BE INTERGER variable type!
	 *		h1	Lowest discharge ever,
	 *		h2	current lowest discharge,
	 *		h3	avg discharge
	 *		h4	Number of full charge cycles,
	 *		h5	Number of full discharge cycles
	 *		h6	Real Ah usage this cycle 					MUST BE INTERGER variable type!
	 *		h7	Min Batt Voltage
	 *		h8	Max Batt Voltage
	 *		h9	Total KWH out
	 *		h10	Lowest ESR Post
	 *		h11	Total charge cycles
	 *		h12	Total kWH in
	 */

	for (z = 1; z <= battnum; z++) { // create
		if ((z == B2) && B_GANGED) {
			sprintf(bootstr2, " B%i, \x1b[7mGANGED to B1\x1b[0m \n\r", z);
		} else {
			cef = (int16_t) ((float) hist[z].cef * (float) 100.0);
			cef_calc = (int16_t) ((float) hist[z].cef_calc * (float) 100.0);
			cef_save = (int16_t) ((float) hist[z].cef_save * (float) 100.0);
			sprintf(bootstr2,
				" B%i,%6i,%6i,%6i,%6i,%6i,%6i,%6i,%6i,%6i,%6i,%6i,%6i,",
				z, hist[z].h[1], hist[z].h[2], hist[z].h[3], hist[z].h[11], hist[z].h[4], hist[z].h[5], hist[z].h[0], hist[z].h[7], hist[z].h[8], hist[z].h[6], hist[z].h[12], hist[z].h[9]);
			puts2USART(bootstr2);

			if (z == CCS.boc) {
				sprintf(bootstr2,
					"%6i,%6i,%6i,%6i,%6li,%7li,%7li,%6i,%7limAh Absorp Time %s\n\r",
					cef, cef_calc, cef_save, B.start_ahu, hist[z].ahir, B.start_ahi, B.start_aho, B.cef_raw, B.absorp_ahi, hm(B.absorp_time));
			} else {
				sprintf(bootstr2,
					"%6i,%6i,%6i,%6i,%6li,%7li,%7li,%6i\n\r",
					cef, cef_calc, cef_save, B.start_ahu, hist[z].ahir, B.start_ahi, B.start_aho, B.cef_raw);
			}
		}
		puts2USART(bootstr2);

		ClrWdt(); // reset the WDT timer
	}
	putrs2USART(battheader1);
	putrs2USART(battheader2);
}

void system_help(void) // display system help on terminal
{
	putrs2USART(keycmds0);
	putrs2USART(keycmds1);
	putrs2USART(keycmds2);
}

void sync_battsoc(void) // set battery SOC to 100% when C40 is in float
{
	putrs2USART(sync0);
	YNKEY = WAIT_M;
	while (YNKEY == WAIT_M) {
		wdtdelay(10);
		idle_loop();
	}
	if (YNKEY == NO_M) {
		putrs2USART(sync2);
		P.SYNCSOC = FALSE;
		return;
	}
	P.SYNCSOC = TRUE;
	putrs2USART(sync1);
}

void display_system(void)
{
	sprintf(bootstr2, "\n\r 0: %u,%lu Controller voltage.", adc_cal[0], R.systemvoltage);
	puts2USART(bootstr2);
	sprintf(bootstr2, "\n\r 1: %u,%lu PV Charge Controller output voltage.", adc_cal[1], R.ccvoltage);
	puts2USART(bootstr2);
	sprintf(bootstr2, "\n\r 2: %u,%li PV input current. Raw ADC %i", adc_cal[2], R.currentin, a50);
	puts2USART(bootstr2);
	sprintf(bootstr2, "\n\r 3: %u,%lu PV input voltage.", adc_cal[3], R.inputvoltage);
	puts2USART(bootstr2);
	sprintf(bootstr2, "\n\r 4: %u,%lu Battery 1 voltage.", adc_cal[4], R.primarypower[B1]);
	puts2USART(bootstr2);
	sprintf(bootstr2, "\n\r 5: %u,%li Inverter Battery current. Raw ADC %i", adc_cal[5], R.current, a300);
	puts2USART(bootstr2);
	sprintf(bootstr2, "\n\r 6: %u,%lu Battery 2 voltage.", adc_cal[6], R.primarypower[B2]);
	puts2USART(bootstr2);
	sprintf(bootstr2, "\n\r 7: %u,%lu Not Used.", adc_cal[7], 0);
	puts2USART(bootstr2);
	sprintf(bootstr2, "\n\r 8: %u,%li Mains charger current. Raw ADC %i", adc_cal[8], R.currentcharger, a50c);
	puts2USART(bootstr2);
}

void set_batt_type(void) // set the battery type LMS in the EEPROM
{
	if (c2raw == NULL0) {
		batttype.busy = FALSE;
		return;
	}
	s_crit(HL);
	cell[batttype.position].id = c2raw; // set battery type eeprom data S gell,M agm, L lead-acid
	e_crit();
	write_data_eeprom(c2raw, 5, batttype.position, 0);                                                                                                                                                                                                                                                                                 \
   	sprintf(bootstr2, "\n\r Battery type %c set in position %lu. \n\r", c2raw, batttype.position);
	puts2USART(bootstr2);
	c2raw = 0;
	batttype.busy = FALSE;
}

void set_ganged(void) // modify the GANGED MODE
{
	GANG_OVERRIDE = TRUE;
	B_GANGED != B_GANGED;
	if (B_GANGED) {
		sprintf(bootstr2, "\r\n Configured batteries in Ganged mode B1 and B2 in parallel.\r\n");
		puts2USART(bootstr2);
	} else {
		sprintf(bootstr2, "\r\n Configured batteries in normal mode B1 and B2 separated.\r\n");
		puts2USART(bootstr2);
	}
	if (B_GANGED) {
		hist[B1].ah = B12_GANGEDAH;
	} else {
		hist[B1].ah = B1AH; // config battery cap in Ah, 1.0 A units
	}
}

void set_tweak(void) // modify active charge parameters
{
	int16_t t_value, t_boc, t_more = 0;
	int32_t t_temp, t_tempo;
	uint32_t t_keytime, t_keytime_next;
	uint8_t t_index, t_prev = 0, t_fast = FALSE;

	if (batttype.busy) {
		t_boc = (int16_t) batttype.position;
		batttype.good = FALSE;
		batttype.busy = FALSE;
		batttype.flag = FALSE;
		batttype.position = 0;
		batttype.length = 0;
	} else {
		t_boc = CCS.boc;
	}
	sprintf(bootstr2, "\r\n Tweaking Battery %i.\r\n", t_boc);
	puts2USART(bootstr2);
	c2raw = 0;
	YNKEY = WAIT_M;
	keynum = 0;
	putrs2USART(tweak0);
	while ((YNKEY == WAIT_M) && (keynum == NULL0)) {
		idle_loop();
	}
	if (YNKEY != WAIT_M) {
		putrs2USART(tweak2);
		return;
	}

	t_index = (uint8_t) keynum - (uint8_t) 0x30; // convert to binary number
	if (t_index > MAX_TWEAK_CMD) {
		putrs2USART(tweak2);
		return;
	}

	YNKEY = WAIT_M;
	t_value = 0;
	t_keytime_next = 0;
	t_prev = 0xff;

