nsaspook/mbmc/swm8722/solar18f8722/swm8722.c
	while (YNKEY == WAIT_M) { // display current status of parameter selected
		switch (t_index) {
		case 1:
			t_tempo = hist[t_boc].ahir;
			sprintf(bootstr2, tweak_t1);
			break;
		case 2:
			t_tempo = hist[t_boc].ahi;
			sprintf(bootstr2, tweak_t2);
			break;
		case 3:
			t_tempo = hist[t_boc].aho;
			sprintf(bootstr2, tweak_t3);
			break;
		case 4:
			t_tempo = hist[t_boc].ahop;
			sprintf(bootstr2, tweak_t4);
			break;
		default:
			t_tempo = 0;
			sprintf(bootstr2, tweak_tw);
			break;
		}
		sprintf(bootstr2, " Selected parameter #%u for adjustment on Battery %i. %s = %li\r\n", t_index, t_boc, bootstr2, t_tempo);
		puts2USART(bootstr2);

		if ((t_keytime_next < 3)) { // 10 fast key presses switches to high value mode
			if (c2raw == t_prev) t_more++;
			if (t_more > 9) {
				t_fast = TRUE;
				putrs2USART(tweak5);
			}
		} else {
			t_fast = FALSE;
			t_more = 0;
			putrs2USART(tweak3);
		}


		YNKEY = WAIT_M;
		c2raw = 0;
		s_crit(HL);
		t_keytime = V.timerint_count; // waiting for keypress start time
		e_crit();
		while (c2raw == NULL0) {
			idle_loop();
		}
		s_crit(HL);
		t_keytime_next = V.timerint_count - t_keytime; // time it took to press key (t_keytime_next-t_keytime)
		e_crit();

		if (YNKEY == NO_M) {
			putrs2USART(tweak2);
			return;
		}
		if ((c2raw == 'Q') || (c2raw == 'q')) {
			putrs2USART(tweak2);
			return;
		}



		if (t_fast) {
			if (c2raw == 'M') t_value += 1000;
			if (c2raw == 'L') t_value += -1000;
			if (c2raw == 'm') t_value += 50;
			if (c2raw == 'l') t_value += -50;
		} else {
			if (c2raw == 'M') t_value += 100;
			if (c2raw == 'L') t_value += -100;
			if (c2raw == 'm') t_value += 5;
			if (c2raw == 'l') t_value += -5;
		}
		t_prev = c2raw;
		switch (t_index) { // make temp value with updates
		case 1:
			t_temp = hist[t_boc].ahir + t_value;
			break;
		case 2:
			t_temp = hist[t_boc].ahi + t_value;
			break;
		case 3:
			t_temp = hist[t_boc].aho + t_value;
			break;
		case 4:
			t_temp = hist[t_boc].ahop + t_value;
			break;
		default:
			t_temp = 0;
			break;
		}
		sprintf(bootstr2, " Adjustment value %i, Parameter %s will be %li when saved.\r\n", t_value, bootstr2, t_temp);
		puts2USART(bootstr2);
	}

	putrs2USART(tweak4);
	switch (t_index) { // save updated value
	case 1:
		hist[t_boc].ahir += t_value;
		break;
	case 2:
		hist[t_boc].ahi += t_value;
		break;
	case 3:
		hist[t_boc].aho += t_value;
		break;
	case 4:
		hist[t_boc].ahop += t_value;
		break;
	default:
		break;
	}
	update_hist();
	putrs2USART(tweak1);
}

void mbmc_update(void)
{
	MBMC.thermo_batt = R.thermo_batt;
	MBMC.cef_boc = (uint32_t) (hist[CCS.boc].cef * 100);

	MBMC.PRIPOWEROK = P.PRIPOWEROK;
	MBMC.DIPSW = DIPSW;
	MBMC.UTC = localtime; // change to localtime

	MBMC.pick = CCS.pick;
	MBMC.boi = CCS.boi;
	MBMC.boc = CCS.boc;
	MBMC.alert = CCS.alert;
	MBMC.bn = CCS.bn;

	//	MBMC.CHARGER_B = CHARGERL; //FIXME waste of 32 bits
	//	MBMC.DIVERSION_B = DIVERSION; //FIXME waste of 32 bits
	MBMC.diversion.flag = 0; // clear the status flag
	MBMC.diversion.flag |= DIVERSION; // bit 0
	MBMC.diversion.flag |= (CHARGERL << 1); // bit 1
	MBMC.diversion.alarm = B.d_code;

	MBMC.systemvoltage = R.systemvoltage;
	MBMC.ccvoltage = R.ccvoltage;
	MBMC.inputvoltage = R.inputvoltage;
	MBMC.primarypower_B1 = R.primarypower[B1];
	MBMC.primarypower_B2 = R.primarypower[B2];
	MBMC.currentin = R.currentin;
	MBMC.current = R.current;
	MBMC.currentload = C.currentload;
	MBMC.current_B1 = cell[B1].current;
	MBMC.current_B2 = cell[B2].current;
	MBMC.harvest = SDC0.harvest;
	MBMC.ports.NEWDATA = TRUE;
	MBMC.ports.ALARM = alarms.alarm_byte;
	MBMC.ports.RUNTIME = (uint8_t) ((int32_t) hist[CCS.boi].ttg / 3600l); // seconds to hours
	MBMC.ports.CCMODE = CCM;
}

void mkbsstring(void) // generate status report string
{
	static uint8_t j, k;
	static uint8_t z;

	ADC_read(); // always update data

	if (battbuffer.copy && P.SYSTEM_STABLE && !SDD0.dumping) { // update sd card with data after block_buffer copy is complete from isr, wait for good data
		if (SDC0.sdinit) {

			//              SD ASCII data block format
			if (!battbuffer.busy && !SDD0.dumping) {
				battbuffer.good = FALSE;
				wipe_sdbuffer();

				s_crit(HL);
				sprintf(block_buffer, sd_data_layout1,
					utctime, P.PRIPOWEROK, DIPSW, SDC0.DAYCLOCK, SDC0.sdpos, SDC0.timekeep, SDC0.time,
					SDC0.harvest.energy, SDC0.harvest.usage, SDC0.harvest.prev_energy, SDC0.harvest.prev_usage,
					SDC0.harvest.e_total, SDC0.harvest.u_total, SDC0.harvest.count, SDC0.harvest.charger,
					SDC0.harvest.c_total, SDC0.harvest.prev_charger, SDC0.harvest.diversion);
				sprintf(block_buffer + strlen(block_buffer), sd_data_layout2,
					CHARGERL, DIVERSION, (int16_t) B_GANGED,
					R.systemvoltage / 100, R.inputvoltage / 100, R.ccvoltage / 100, R.primarypower[B1] / 100,
					R.primarypower[B2] / 100, R.currentin, R.current, C.currentload,
					cell[B1].cconline, cell[B1].online, cell[B1].cycles, cell[B2].cconline, cell[B2].online,
					cell[B2].cycles, cell[B1].id, cell[B2].id, cell[B3].id, cell[B4].id,
					R.thermo_batt, (uint32_t) (hist[CCS.boc].cef * 100), (int16_t) MBMC.diversion.power);
				sprintf(block_buffer + strlen(block_buffer), sd_data_layout3,
					C.temp_drate, B.start_ahu, B.cef_raw, B.start_ahi, B.start_aho, B.absorp_ahi, B.absorp_time,
					B.charge_time_left, (int16_t) B.yesterday, (int16_t) B.today);
				if (!PIE1bits.TX1IE) {
					mbmc_update(); // push new data into the MBMC structure
				}
				e_crit();

				for (z = 1; z <= battnum; z++) { // create
					sprintf(block_buffer + strlen(block_buffer), sd_data_layout4,
						z, cell[z].noload / 100,
						cell[z].voltage / 100, hist[z].ahi / 100, hist[z].aho / 100, hist[z].ahop / 100, hist[z].kwi / 10000,
						hist[z].kwo / 10000, hist[z].udod, hist[z].ttg, hist[z].esrp, hist[z].esr, hist[z].h[9], hist[z].h[10], soc_method[z]);
				}
				strcatpgm2ram(block_buffer, sd_data_layout5); // terminate the SD ACSII data block

				battbuffer.length = strlen(block_buffer); // set total string length for copy
				if (battbuffer.length > SDBUFFERSIZE) {
					ALARMOUT = R_ON; //
					alarm_buffer[almctr].bn = battbuffer.length - SDBUFFERSIZE;
					alarm_buffer[almctr++].alm_num = 12;
					alarm_codes.alm_flag = TRUE;
					check_alarm(CCS.boc, " mkbstring1 Data Record block size too large");
					battbuffer.length = SDBUFFERSIZE; // if it's too large set it to the max string size
				}
				battbuffer.good = TRUE; // buffer is ready to copy
			}

			if (sdret = mmc_write_block(SDC0.sdpos++)) // write data log buffer block
				sderr++;
			SDC0.sdnext = SDC0.sdpos; // update last block position
			s_crit(HL);
			SDC0.time = V.timerint_count; // update current time clock
			for (j = 0; j < HISTBATTNUM; j++) {
				hist[j + 1].h[12] = (int16_t) (hist[j + 1].kwi / 10000l); // save power in int16_t from uint32_t
				hist[j + 1].h[9] = (int16_t) (hist[j + 1].kwo / 10000l);
				for (k = 0; k < HPARAM_SIZE; k++) {
					SDC0.h[j][k] = hist[j + 1].h[k]; // copy primary battery history data to SD buffer
				}
			}
			e_crit();
			if (sizeof( SDC0) > SDBUFFERSIZE) {
				ALARMOUT = R_ON; //
				alarm_buffer[almctr].bn = sizeof( SDC0) - SDBUFFERSIZE;
				alarm_buffer[almctr++].alm_num = 12;
				alarm_codes.alm_flag = TRUE;
				check_alarm(CCS.boc, " mkbstring2 SD card info block size too large");
			}
			memcpy((void *) &block_buffer[0], (void *) &SDC0, sizeof( SDC0));
			if (sdret = mmc_write_block(SDINFO)) // write SD info block
				sderr++;
			battbuffer.copy = FALSE; // data block in on SD card
		}
	}
}

