nsaspook/mbmc/swm8722/solar18f8722/swm8722.c
int8_t* hms(uint32_t sec) // convert int32_t (seconds) to time string
{
	uint32_t h = 0, m = 0, s = 0;

	if (sec > MAXSECONDS) sec = MAXSECONDS; // max time in seconds
	s = sec;
	h = (s / 3600);
	s = s - (h * 3600);
	m = (s / 60);
	s = s - (m * 60);
	sprintf(hms_string, "%01lu:%02lu:%02lu", h, m, s);
	return hms_string;
}

int8_t* hm(uint32_t sec) // convert int32_t (seconds) to time string
{
	uint32_t h = 0, m = 0, s = 0;
	if (sec > MAXSECONDS) sec = MAXSECONDS; // max time in seconds
	s = sec;
	h = (s / 3600);
	s = s - (h * 3600);
	m = (s / 60);
	s = s - (m * 60);
	sprintf(hms_string, "%01lu:%02lu", h, m);
	return hms_string;
}

int16_t ABSI(int16_t i)
{
	if (i < 0)
		return -i;
	else
		return i;
}

int32_t ABSL(int32_t i)
{
	if (i < 0)
		return -i;
	else
		return i;
}

int8_t* voltfp(uint32_t millvolts, int8_t *strprt) // convert uint32_t (millvolts) to voltage string
{
	//   static int32_t iw = 0, ip = 0;
	//   static float voltfrak;
	voltfrak = (float) millvolts / 1000;
	iw = (int32_t) ((float) voltfrak);
	ip = (int32_t) ((float) voltfrak * 100) - iw * 100;
	sprintf(strprt, "%d.%02d", (int16_t) iw, (int16_t) ip);
	return strprt;
}

int8_t* voltfps(uint32_t millvolts, int8_t *strprt) // convert uint32_t (millvolts) to voltage string (short)
{
	//   int32_t iw = 0, ip = 0;
	//   float voltfrak;
	voltfrak = (float) millvolts / 1000;
	iw = (int32_t) ((float) voltfrak);
	ip = (int32_t) ((float) voltfrak * 10) - iw * 10;
	sprintf(strprt, "%d.%01d", (int16_t) iw, (int16_t) ip);
	return strprt;
}

int8_t* voltfpi(int32_t millvolts, int8_t *strprt) // convert int32_t (mill volts/watts/current) to string (integer with Kilo)
{
	//   int32_t iw = 0, ip = 0;
	//   float voltfrak;
	//   int8_t sign = ' ';

	sign = ' '; // init sign
	if (millvolts < 0)
		sign = '-';
	voltfrak = (float) millvolts / 1000;
	iw = (int32_t) ((float) voltfrak);
	ip = (int32_t) ((float) voltfrak * 10) - iw * 10;
	if (ABSL(iw) < 1500) {
		sprintf(strprt, "%c%li", sign, ABSL(iw));
	} else {
		voltfrak = voltfrak / 1000;
		iw = (int32_t) ((float) voltfrak);
		ip = (int32_t) ((float) voltfrak * 100) - iw * 100;
		sprintf(strprt, "%c%li.%02lik", sign, ABSL(iw), ABSL(ip));
	}
	return strprt;
}

int8_t* ahfp(int32_t millah, int8_t *strprt) // convert int32_t (.1 of Ah) to Ah string
{
	//   int16_t iw = 0, ip = 0;
	//   float ahfrak;
	//   int8_t sign = ' ';

	sign = ' '; // init sign
	if (millah < 0)
		sign = '-';
	ahfrak = (float) millah / 10;
	iw = (int32_t) ((float) ahfrak);
	ip = (int32_t) ((float) ahfrak * 10) - iw * 10;
	sprintf(strprt, "%c%d.%01d", sign, ABSI(iw), ABSI(ip));
	return strprt;
}

// The battery relay sends power to the controller buss, the charge connects the battery to the charging buss

void ChargeRelayOn(uint8_t bn, uint8_t FLOATSW) // switch relays for battery
{
	if (FLOATSW && (CCMODE == FLOAT_M)) {
		cell[bn].cconline = TRUE; // charging from CC
		CCOUTOPENSW = R_OFF;
		wdttime(BATRUNF);
		CHRG2 = R_ON; // charge #2 relay/on ,use as float battery
		wdttime(BATRUNF);
		switch (bn) {
		case B1B:
			CHRG1 = R_ON; // charge #1 relay/on
			if (B_GANGED) CHRG2 = R_ON;
			break;
		case B2B:
			CHRG2 = R_ON; // charge #2 relay/on
			break;
		case B3B:
			CHRG3 = R_ON; // charge #3 relay/on
			break;
		case B4B:
			CHRG4 = R_ON; // charge #4 relay/on
			break;
		default:
			CHRG1 = R_ON; // charge #1 relay/on
			break;
		}
		wdttime(BATRUNF);
		if (bn != B2)
			CHRG2 = R_OFF; // switch off transfer battery
		BMMODE = FLOAT_M;
	} else {
		cell[bn].cconline = TRUE; // charging from CC
		SOLAROFF = R_ON; // PV off before C40
		wdttime(BATRUNF);
		switch (bn) {
		case B1B:
			BAT1 = R_ON; // battery #1 relay/off
			CHRG1 = R_ON; // charge #1 relay/on
			if (B_GANGED) {
				BAT2 = R_ON; // battery #2 relay/off
				CHRG2 = R_ON; // charge #2 relay/on
			}
			break;
		case B2B:
			BAT2 = R_ON; // battery #2 relay/off
			CHRG1 = R_OFF;
			CHRG2 = R_ON; // charge #2 relay/on
			if (B_GANGED) {
				BAT1 = R_ON; // battery #1 relay/off
				CHRG1 = R_ON; // charge #1 relay/on
			}
			break;
		case B3B:
			BAT3 = R_ON; // battery #3 relay/off
			CHRG1 = R_OFF;
			CHRG3 = R_ON; // charge #3 relay/on
			break;
		case B4B:
			BAT4 = R_ON; // battery #4 relay/off
			CHRG1 = R_OFF;
			CHRG4 = R_ON; // charge #4 relay/on
			break;
		default:
			BAT1 = R_ON; // battery #1 relay/off
			CHRG1 = R_ON; // charge #1 relay/on
			break;
		}
	}
	wdttime(BATRUNF);
	CCOUTOPENSW = R_OFF; //
	wdttime(BATRUNF);
	SOLAROFF = R_OFF;
	wdttime(BATRUNF);
	BMMODE = CHARGE_M;

	if (bn != B1) { // switch off float cell and update status
		CHRG1 = R_OFF; // switch off transfer battery
		wdttime(BATRUNF);
		cell[B1].cconline = FALSE;
	}
}

void ChargeRelayOff(uint8_t bn, uint8_t FLOATSW)
{
	if (FLOATSW && (CCMODE == FLOAT_M)) {
		cell[bn].cconline = FALSE; // not charging from CC
		CCOUTOPENSW = R_OFF;
		wdttime(BATRUNF);
		CHRG1 = R_ON; // charge #1 relay/on ,use as float battery
		cell[B1].cconline = TRUE; // charging from CC
		wdttime(BATRUNF);
		switch (bn) {
		case B1B:
			BAT1 = R_OFF; // battery #1 relay/on
			if (B_GANGED) BAT2 = R_OFF; // battery #2 relay/on
			break;
		case B2B:
			BAT2 = R_OFF; // battery #2 relay/on
			CHRG2 = R_OFF; // charge #2 relay/off
			break;
		case B3B:
			BAT3 = R_OFF; // battery #3 relay/on
			CHRG3 = R_OFF; // charge #3 relay/off
			break;
		case B4B:
			BAT4 = R_OFF; // battery #4 relay/on
			CHRG4 = R_OFF; // charge #4 relay/off
			break;
		default:
			BAT1 = R_OFF; // battery #1 relay/on
			break;
		}
		wdttime(BATRUNF);
		SOLAROFF = R_OFF;
		wdttime(BATRUNF);
		BMMODE = FLOAT_M;
	} else {
		cell[bn].cconline = FALSE; // not charging from CC
		SOLAROFF = R_ON; // PV off before C40
		wdttime(BATRUNF);
		switch (bn) {
		case B1B:
			BAT1 = R_OFF; // battery #1 relay/on
			CHRG1 = R_OFF; // charge #1 relay/off
			if (B_GANGED) {
				BAT2 = R_OFF; // battery #2 relay/on
				CHRG2 = R_OFF; // charge #2 relay/off
			}
			break;
		case B2B:
			BAT2 = R_OFF; // battery #2 relay/on
			CHRG2 = R_OFF; // charge #2 relay/off
			if (B_GANGED) {
				BAT1 = R_OFF; // battery #1 relay/on
				CHRG1 = R_OFF; // charge #1 relay/off
			}
			break;
		case B3B:
			BAT3 = R_OFF; // battery #3 relay/on
			CHRG3 = R_OFF; // charge #3 relay/off
			break;
		case B4B:
			BAT4 = R_OFF; // battery #4 relay/on
			CHRG4 = R_OFF; // charge #4 relay/off
			break;
		default:
			BAT1 = R_OFF; // battery #1 relay/on
			CHRG1 = R_OFF; // charge #1 relay/off
			break;
		}
		wdttime(BATRUNF);
		SOLAROFF = R_OFF;
		wdttime(BATRUNF);
		BMMODE = IDLE_M;
	}
}

void battalarm(int16_t time, int16_t battno, int16_t mode)
{
	ALARMOUT = R_ON;
}

//FIXME fix check_alarm

/*  prints messages from the alarm array, need a rework as it's buggy */
uint8_t check_alarm(uint8_t bn, const rom int8_t* where) // print alarm codes to terminal or just the battery number with code 251
{ // or set flag with code 253 or clear flag code 252
	static uint8_t i = 0, alm_num = 255; // if bn is 255 return state of alarm_codes.alm_flag flag TRUE/FALSE, 254 return current alarm code
	static uint8_t last_alm_num = 255;

	s_crit(HL);

	if (bn > 250) {
		if (bn == 255) {
			if (alarm_codes.alm_flag) {
				e_crit();
				return TRUE;
			} else {
				e_crit();
				return FALSE;
			}
		}
		if (bn == 254) {
			e_crit();
			return alarm_buffer[almctr].alm_num;
		}
		if (bn == 253) {
			alarm_codes.alm_flag = TRUE;
			e_crit();
			return 253;
		}
		if (bn == 252) {
			alarm_codes.alm_flag = FALSE;
			e_crit();
			return 252;
		}
		if (bn == 251) {
			alarm_codes.alm_flag = FALSE;
			e_crit();
			return alarm_buffer[almctr].bn;
		}
	}

	if (alarm_codes.alm_flag == NULL0) { // nothing, lets go
		e_crit();
		return FALSE;
	}

