nsaspook/mbmc/swm8722/solar18f8722/swm8722.c
	while (almctr > NULL0) {
		alm_num = alarm_buffer[--almctr].alm_num; // move down the alarm stack
		if (alm_num == last_alm_num) break;
		last_alm_num = alm_num;
		term_time();
		putrs2USART(where);
		sprintf(bootstr2, " BN%u, Q%u, Battery %02x,", bn, almctr, alarm_buffer[almctr].bn); // use the message battery number if set
		puts2USART(bootstr2);
		i = 0; // set alarm index to zero
		if (alm_num == i++) putrs2USART(almcode0); //0
		if (alm_num == i++) putrs2USART(almcode1); //1
		if (alm_num == i++) putrs2USART(almcode2); //2
		if (alm_num == i++) putrs2USART(almcode3); //3
		if (alm_num == i++) putrs2USART(almcode4); //4
		if (alm_num == i++) putrs2USART(almcode5); //5
		if (alm_num == i++) putrs2USART(almcode6); //6
		if (alm_num == i++) putrs2USART(almcode7); //7
		if (alm_num == i++) putrs2USART(almcode8); //8
		if (alm_num == i++) putrs2USART(almcode9); //9
		if (alm_num == i++) putrs2USART(divert0); //10
		if (alm_num == i++) putrs2USART(divert1); //11
		if (alm_num == i++) putrs2USART(battbuffer0); //12
		if (alm_num == i++) putrs2USART(almcode10); //13
		if (alm_num == i++) putrs2USART(almcode11); //14
		if (alm_num == i++) putrs2USART(almcode12); //15
		if (alm_num == i++) putrs2USART(almcode13); //16
		if (alm_num == i++) putrs2USART(almcode14); //17
		if (alm_num == i++) putrs2USART(almcode15); //18
		if (alm_num == i++) putrs2USART(almcode16); //19
		if (alm_num == i++) putrs2USART(charger2); //20
		if (alm_num == i++) putrs2USART(charger3); //21
		if (alm_num == i++) putrs2USART(charger4); //22
		if (alm_num == i++) putrs2USART(almcode17); //23
		if (alm_num == i++) putrs2USART(almcode18); //24
		if (alm_num == i++) putrs2USART(almcode19); //25
		if (alm_num == i++) putrs2USART(almcode20); //26
		if ((alm_num > i) && (alm_num < 250)) { // if greater than last defined alarm code
			sprintf(bootstr2, " UNKNOWN Alarm code %u \r\n", alm_num);
			puts2USART(bootstr2);
		}
	};
	if (almctr == NULL0) {
		alarm_codes.alm_flag = FALSE;
	}
	alarm_buffer[almctr].bn = B0; // set default battery number to zero
	e_crit();
	return NULL0;
}

float update_cef(uint8_t bn, uint8_t mode) // try to find the real charge eff factor
{
	s_crit(HL);
	if (mode == TRUE) { // startup cef values
		if (hist[bn].bsoc < SOC_DERATE) { // decide what value to use at the current SOC
			hist[bn].cef = CEF_LSOC; // use cef for low state of charge
		} else {
			hist[bn].cef = CEF_HSOC; // use the cef for higher states of charge
		}
		if (hist[bn].cef > CEF_MAX) hist[bn].cef = CEF_MAX;
		if (hist[bn].cef < CEF_MIN) hist[bn].cef = CEF_MIN;
		hist[bn].cef_save = hist[bn].cef; // store the original cef
		e_crit();
		return hist[bn].cef;
	}

	/* Needs work to simplify code */
	if (hist[bn].bsoc < SOC_DERATE) { // adjust charge eff with SOC if battery nears fully charged
		hist[bn].cef = CEF_LSOC; // usually around 91% 0-SOC_DERATE SOC
	} else {
		if (hist[bn].cef_calc > 0.99) { // we are out of range to use realtime data, cef_calc = 100.0.means NO
			hist[bn].cef = CEF_HSOC; // use the static value, high rates of battery charge have lower eff factors to fully charged
		}
		if (hist[bn].cef < CEF_MIN) { // if we go too low reset to static value
			hist[bn].cef = CEF_HSOC; // use cef for HIGH state of charge
		} else if (hist[bn].cef_calc < 1.00) { // only update if we can use realtime data, cef_calc = 100.0.means NO
			hist[bn].cef = hist[bn].cef_save; // use the archived cef for higher states of charge
			if (hist[bn].cef_calc <= CEF_LSOC) { // update cef from realtime data
				if (hist[bn].cef <= SOC_CEF) hist[bn].cef = (hist[bn].cef_calc + hist[bn].cef_save) / 2.0; // use dynamic value average
			}
		}
	}
	if (hist[bn].cef > CEF_MAX) hist[bn].cef = CEF_MAX;
	if (hist[bn].cef < CEF_MIN) hist[bn].cef = CEF_MIN;
	if (CHARGERL == R_ON) divert_power(OFF, YES, 0); // Switch off power to extra loads when charging (waste)
	e_crit();
	return hist[bn].cef;
}

/*
 * Return a battery SOC from a adjusted voltage, store this adjusted voltage in the vsoc array
 * SOC is also set in hist[z].bsoc GLOBAL
 */
uint16_t Volts_to_SOC(uint32_t cvoltage, uint8_t z)
{
	static uint8_t slot;

	if ((R.thermo_batt - Temp_ZERO) != 0) cvoltage = (uint32_t) ((int32_t) cvoltage - ((int32_t) (R.thermo_batt - Temp_ZERO) / (int32_t) BFACTOR_TEMP)); // include temp correction
	if (cell[z].current > 0) { // adjust SOC for battery loading
		cvoltage += cell[z].current / BVSOC_C_OFF; // current = 400 # 40amps loading down voltage
	} else {
		if (!B_GANGED) cvoltage += BVSOC_SV_OFF; // controller loading on standby battery
	}
	vsoc[z] = cvoltage;
	hist[z].bsoc = 0;
	cell[z].fresh = FALSE;
	for (slot = 0; slot < BVSOC_SLOTS; slot++) {
		if (cvoltage > BVSOC_TABLE[slot][0]) {
			hist[z].bsoc = BVSOC_TABLE[slot][1];
		}
	}
	/* if the battery voltage is too high or the SOC is too low it's not FRESH */
	if ((hist[z].bsoc > BVSOC_FRESH) && (cvoltage <= BVSOC_HIGH)) cell[z].fresh = TRUE;
	if (z > HISTBATTNUM) B.r_soc[z] = (uint8_t) hist[z].bsoc; // fill in for controller batteries
	return hist[z].bsoc;
}

/* SOC is set in hist[z].bsoc GLOBAL , load up the cell for testing on startup and store value
 * SOC_BLEND 0 = no blending, 1 = blend loaded with rest soc, 2 = reset stored soc to current soc value
 */
uint16_t Get_RestSOC(uint8_t z, uint8_t S_SOC, blendmode_t SOC_BLEND)
{
	static uint16_t soc_loaded[HISTBATTNUM] = {0, 0}, soc_result = 0;

	if ((z == 0) || (z > HISTBATTNUM)) return 0; // only for primary cells
	BLENDMODE = SOC_BLEND; // set global state var
	if (S_SOC) {
		ADC_read(); // read loaded battery voltage from charge line.
		term_time();
		sprintf(bootstr2, " Get_RestSOC Load testing Battery %i V%li.\r\n", z, R.primarypower[z]);
		puts2USART(bootstr2);
		ChargeRelayOn(z, TRUE);
		wdttime(BATRUNF);
		BATLOAD_HI = R_ON; // battery load relay/on
		wdttime(BATTEST); // drain the battery
	}
	ADC_read(); // read loaded battery voltage from charge line.
	soc_result = Volts_to_SOC(R.primarypower[z], z);
	if (S_SOC) {
		soc_loaded[z - 1] = soc_result; // Store the loaded SOC value, convert z to soc_loaded array index (z-1) B1=0,B2=1
		term_time();
		sprintf(bootstr2, " Get_RestSOC Battery %i V%li Load Disconnected.\r\n", z, R.primarypower[z]);
		puts2USART(bootstr2);
		BATLOAD_HI = R_OFF;
		ChargeRelayOff(z, FALSE);
		wdttime(BATRUNF);
	}
	if (SOC_BLEND == DO_BLEND) {
		soc_result = (soc_result + soc_loaded[z - 1]) / 2; // avg the two SOC results
	}
	if (SOC_BLEND == MILD_BLEND) {
		soc_result = (soc_result + soc_result + soc_loaded[z - 1]) / 3; // avg the two SOC results with bias to result
	}
	if (SOC_BLEND == CLEAR_BLEND) {
		soc_loaded[z - 1] = soc_result;
	}
	return soc_result;
}

void fail_safe(void)
{
	P.FAILSAFE = TRUE;
	CCOUTOPENSW = R_OFF;
	SOLAROFF = R_OFF;
	if (LOADNOTFAN || !P.COOLING) PVLOAD = R_OFF;
	BCRELAYS = 0xFF;
	BAT1 = R_ON; // battery #1 relay/off
	CHRG1 = R_ON; // charge #1 relay/on
	CCS.boc = B1;

	while (DIPSW6 == HIGH) { // wait until switch is clear
		ADC_read();
		sprintf(bootstr2, "FS T%s,SV%lu             ", hms(V.timerint_count), R.systemvoltage / 100);
		LCD_VC_puts(VC0, DS0, YES);

		sprintf(bootstr2, "PV%lu,PI%li,CV%lu           ", R.inputvoltage / 100, R.currentin / 10, R.ccvoltage / 100);
		LCD_VC_puts(VC0, DS1, YES);

		sprintf(bootstr2, "B1V%lu,B2V%lu,LI%li                 ", R.primarypower[B1] / 100, R.primarypower[B2] / 100, C.currentload / 10);
		LCD_VC_puts(VC0, DS2, YES);

		sprintf(bootstr2, "%lu, %lu, %lu                  ", V.timerint_count, V.clock50, V.clock50 / V.timerint_count);
		LCD_VC_puts(VC0, DS3, YES);

		wdtdelay(5000);
		idle_loop();
	}
	P.FAILSAFE = FALSE;
	s_crit(HL);
	c_off = V.timerint_count;
	e_crit();
	CHARGERL = R_OFF;
	alarm_buffer[almctr].bn = CCS.boc;
	alarm_buffer[almctr++].alm_num = 3;
	alarm_codes.alm_flag = TRUE;
	check_alarm(CCS.boi, " fail1 "); // send alarm codes to terminal if alm_flag is set
}

