nsaspook/mbmc/swm8722/solar18f8722/swm8722.c
int16_t sd_dump(int16_t mode) // mode = dump device 0 RS-232 port
{
	static int16_t ret = 0, j = 0, k = 0;
	static uint32_t i = 0, dsize = 0;

	sprintf(bootstr2, "Dump SD Card Com2.  ");
	LCD_VC_puts(VC0, DS0, YES);

	ret = mmc_read_block(SDINFO); // read info block
	if (ret) {
		sprintf(bootstr2, "No SD Card, Goodbye. ");
		LCD_VC_puts(VC0, DS1, YES);
		term_time();
		putrs2USART(sddump0);
		s_crit(HL);
		SDD0.dumping = FALSE;
		e_crit();
		return ERR1;
	}
	memcpy((void *) &sdc0b1, (void *) &block_buffer[0], sizeof( sdc0b1));
	if (sdc0b1.magic == MAGIC) { // see if we have a valid MBMC data SDCARD

		if (SDD0.type == 'h') {
			if (sdc0b1.sdnext > 1001) { // send last 1000 records or less
				dsize = sdc0b1.sdnext - 999;
			} else {
				dsize = 1;
			}
		} else {
			dsize = 1; // default: start from first record
		}

		for (i = dsize; i < sdc0b1.sdnext; i++) { // pull the records from the SDCARD
			sprintf(bootstr2, "%lu of %lu records.      ", i, sdc0b1.sdnext);
			LCD_VC_puts(VC0, DS1, YES);

			if (!SDD0.dumping) break; // stop the madness
			ret = mmc_read_block(i); // read data block
			if (ret) {
				ret = mmc_read_block(i); // read data block again
				if (ret) continue; // possible bad block, skip
			}
			k = strlen((int8_t *) block_buffer);
			if (k > SDBUFFERSIZE) k = SDBUFFERSIZE;
			// setup ISR xmit buffer structure
			mbmc_dumpflag.data_pos = 0;
			mbmc_dumpflag.data_len = k;
			mbmc_dumpflag.data_ptr = (uint8_t*) & block_buffer; // data pointer to data block from SD CARD

			PIE3bits.TX2IE = HIGH; // start data xmit from ISR
			while (PIE3bits.TX2IE) { // if it's HIGH we are still sending data
				ClrWdt(); // wait for buffer xmit complete
			}
			if (i % 32 == NULL0) ADC_read(); //  update data, sometimes
			idle_loop(); // stay in touch with the network
		}
	}
	mbmc_dumpflag.data_pos = 0; // reset buffer structure for manual sends
	mbmc_dumpflag.data_len = 0;
	P2wait(); // wait for xmit clear
	TXREG2 = '\r'; // return
	P2wait(); // wait for xmit clear
	TXREG2 = '\n'; // newline
	s_crit(HL);
	SDD0.dumping = FALSE;
	e_crit();
	return NULL0;
}

int16_t W_SDC0_EEP(uint16_t address) // write SDCO to eep starting at address
{
	static uint16_t i = 0;
	//  write_data_eeprom ( uint8_t data, uint8_t count, uint16_t addr, uint16_t offset )
	for (i = 0; i < sizeof( sdc0b1); i++) {
		write_data_eeprom(block_buffer[i], (uint8_t) sizeof( sdc0b1), i, address);
	}
	return NULL0;
}

int16_t initsd(void)
{
	static uint8_t j = 0, k = 0;
	static uint16_t i = 0;

	SDSAFE = S_OFF;
	clr_lcd();
	init_sdspi(); // config SPI port for SDCARD access
	if (disk_initialize() == NULL0) {
		sprintf(bootstr2, "Looking for SD Card ");
		LCD_VC_puts(VC0, DS0, YES);

		i = MMC_get_volume_info();
		if (i == ERR2) {
			sprintf(bootstr2, "Wrong SD Card Found %i.", (int16_t) SDC0.sdtype);
			LCD_VC_puts(VC0, DS0, YES);
			term_time();
			putrs2USART(sddump1);
			s_crit(HL);
			return i;
		}
		if (i == ERR1) {
			sprintf(bootstr2, "No SD Card Found.");
			LCD_VC_puts(VC0, DS0, YES);
			term_time();
			putrs2USART(sddump0);
			s_crit(HL);
			return i;
		}

		if (SDC0.sdtype == 6) {
			sprintf(bootstr2, "%s,%i Size %luM                     ", vinf->name,
				SDC0.sdtype, vinf->size_MB / 1000);
		} else {
			sprintf(bootstr2, "%s,%i Size %luM                     ", vinf->name,
				SDC0.sdtype, vinf->size_MB);
		}
		LCD_VC_puts(VC0, DS0, YES);

		sprintf(bootstr2, "Serial %lu                     ", vinf->serial);
		LCD_VC_puts(VC0, DS1, YES);

		wdttime(BATRUNF + BATRUNF);
		memset(block_buffer, 0, SDBUFFERSIZE);
	} else {
		return ERR1;
	}

	i = mmc_read_block(SDINFO); // dummy read
	i = mmc_read_block(SDINFO); // read info block
	if (i) return ERR1; // error reading info block

	memcpy((void *) &sdc0b1, (void *) &block_buffer[0], sizeof( sdc0b1)); //
	if ((sdc0b1.magic == MAGIC) && !DIPSW1) {
		sprintf(bootstr2, "Loading SD Card data.   ");
		LCD_VC_puts(VC0, DS1, YES);

		SDC0.sdpos = sdc0b1.sdnext; // update from sdcard next block to write
		SDC0.timekeep += sdc0b1.time;
		SDC0.harvest = sdc0b1.harvest;
		for (j = 0; j < HISTBATTNUM; j++) {
			for (k = 0; k < HPARAM_SIZE; k++) {
				hist[j + 1].h[k] = sdc0b1.h[j][k]; // copy primary battery history data, sdcard h array 0=B1, 1=B2
			}
			hist[j + 1].kwi = (int32_t) ((int32_t) hist[j + 1].h[12] * 10000l); // restore power from int16_t to uint32_t
			hist[j + 1].kwo = (int32_t) ((int32_t) hist[j + 1].h[9] * 10000l);
		}
		sprintf(bootstr2, "SDHC/SDXC Card Ready ");
		LCD_VC_puts(VC0, DS2, YES);
		W_SDC0_EEP(SDC0EEP); // mirror SDC0 data to eep at address
		sprintf(bootstr2, "Update EEP/SD data.        ");
		LCD_VC_puts(VC0, DS3, YES);
		term_time();
		putrs2USART(sddump2);
		SDC0.DAYCLOCK = TRUE; // set dayclock after SD data load
		if (SDC0.sdpos > SDEND) {
			SDC0.sdpos = SDSTART;
			SDC0.sdnext = SDSTART;
			term_time();
			putrs2USART(sddump4);
		}
	} else {
		sprintf(bootstr2, "INIT new SD Card.       ");
		LCD_VC_puts(VC0, DS1, YES);
		sprintf(bootstr2, "SDHC/SDXC Card Ready ");
		LCD_VC_puts(VC0, DS2, YES);

		s_crit(HL);
		SDC0.timekeep = V.timerint_count;
		e_crit();
		init_hist_data();
		// other data has already been set earlier
		wipe_sdbuffer();
		memcpy((void *) &block_buffer[0], (void *) &SDC0, sizeof( SDC0));
		sdret = mmc_write_block(SDINFO); // init new card block
		W_SDC0_EEP(SDC0EEP); // mirror SDC0 data to eep at address
		sprintf(bootstr2, "Update EEP/SD data.        ");
		LCD_VC_puts(VC0, DS3, YES);
		term_time();
		putrs2USART(sddump3);
	}
	SDSAFE = S_ON;
	return NULL0;
}

void ansidraw(int16_t mode) // tek 410x/ansi drawing stuff
{
	putc2(ESC);
	putc2('['); // clear screen
	putc2('2');
	putc2('J');
	if (SIM_MODE) putrs2USART(SIMULA);
	putrs2USART(hello1);
	putrs2USART(hello0);
}

void init_hist_data(void)
{
	static uint8_t j = 0, k = 0;

	term_time();
	putrs2USART(" Init History Data \r\n");
	SDC0.time = 0;
	SDC0.magic = MAGIC;
	SDC0.sdpos = SDSTART;
	SDC0.sdnext = SDSTART;
	SDC0.harvest.energy = 0;
	SDC0.harvest.charger = 0;
	SDC0.harvest.usage = 0;
	SDC0.harvest.diversion = 0;
	SDC0.harvest.prev_energy = 0;
	SDC0.harvest.prev_charger = 0;
	SDC0.harvest.prev_usage = 0;
	SDC0.harvest.e_total = 0;
	SDC0.harvest.c_total = 0;
	SDC0.harvest.u_total = 0;
	SDC0.harvest.count = 0;
	SDC0.DAYCLOCK = FALSE;
	for (j = 0; j <= battnum; j++) { // set all data including the dummy battery
		for (k = 0; k < HPARAM_SIZE; k++) {
			hist[j].h[k] = 0; // zero primary battery history data
		}
		hist[j].h[7] = BATTHIGH;
		hist[j].h[8] = BATTLOW;

		hist[j].h[10] = ESRHIGH;
		hist[j].kwi = 0; // reset battery power stats
		hist[j].kwo = 0; // reset battery power stats
	}
}

void main(void) // Lets Party
{
	static uint32_t waittime = 0;
	static uint8_t eep_char = NULL0, boi = 0, bn = B0B, j = 0, k = 0, ftest = NULL0, lmode = TRUE;
	static uint8_t z = 0, tmp8 = 0;

