nsaspook/mbmc/swm8722/solar18f8722/swm8722.c
	MBMC.MBMCID = (int32_t) __MBMC_ID + ((int32_t) MAGIC << SHIFT8); // set the card id for the network and MAGIC version number in bits 8..23
	MBMC.diversion.flag = FALSE;
	MBMC.diversion.power = 1; // show a small signal at startup
	MBMC.diversion.power_control = 0;
	MBMC.diversion.alarm = 0;
	mbmcflag.cmd_timeout = TRUE;
	netdword_pos = 0; // set pointer, load flag
	mbmcflag.data_pos = 0; // init the data pointer position
	mbmcflag.data_len = 0; // init the buffer length
	mbmcflag.data_ptr = (uint8_t*) & MBMC; // default data pointer
	mbmccell = (celltype*) & cell; // default data pointer
	mbmc_dumpflag.data_pos = 0; // init the data pointer position
	mbmc_dumpflag.data_len = 0; // init the buffer length
	mbmc_dumpflag.data_ptr = (uint8_t*) & block_buffer; // default data pointer
	UTC_flag = FALSE;
	UTC_ok = FALSE;
	CCMODE = IDLE_M;
	BMMODE = IDLE_M;
	alarm_buffer[B0].bn = B0;
	solarup_delay = NULL0;
	P.SAVE_DAILY = FALSE;
	// energy,usage,prev_energy,prev_usage,e_total,u_total,count, charger vars;
	SDC0.harvest.energy = 0;
	SDC0.harvest.charger = 0;
	SDC0.harvest.usage = 0;
	SDC0.harvest.diversion = 0;
	SDC0.harvest.prev_energy = 0;
	SDC0.harvest.prev_charger = 0;
	SDC0.harvest.prev_usage = 0;
	SDC0.harvest.e_total = 0;
	SDC0.harvest.c_total = 0;
	SDC0.harvest.u_total = 0;
	SDC0.harvest.count = 0;
	SDC0.DAYCLOCK = FALSE;
	B.yesterday = 0;
	B.today = 0;
	B.equal = 0;
	C.t_comp = 1.0; // 1.0 is the default
	dsi = VC0; // set display index to 0 for monitor strings
	battbuffer.busy = FALSE;
	battbuffer.flag = FALSE;
	battbuffer.copy = FALSE;
	battbuffer.good = TRUE;
	CCS.alert = FALSE;
	CCS.bn = 0;
	bmt[B0].soc[SOC_50].soc = 50;
	bmt[B0].soc[SOC_70].soc = 70;
	bmt[B0].soc[SOC_85].soc = 85;
	bmt[B0].soc[SOC_100].soc = 95;
	bmt[B1].soc[SOC_50].soc = 50;
	bmt[B1].soc[SOC_70].soc = 70;
	bmt[B1].soc[SOC_85].soc = 85;
	bmt[B1].soc[SOC_100].soc = 95;
	alarm_codes.alm_flag = FALSE;
	for (z = 0; z < LPCHANC; z++) { // init lp_filter array
		smooth[z] = 0;
	}
	smooth[LP_CCEFF] = 255; // preset value
	CCEFF = (int16_t) lp_filter((float) 255, LP_CCEFF, FALSE); // update filter
	sprintf(bootstr2, "\r\n^^^,0,No Status Report,###");

#ifdef	__18F8722
	config_pic(PIC_8722); // configure all controller hardware to the correct settings and ports
#endif

	for (z = 1; z <= battnum; z++) { //      make sure nothings valid until voltage tested.
		cell[z].valid = NULL0;
	}
	cell[B0].valid = TIMEROFFSET;

	sprintf(bootstr2, "********************"); // blank display data
	LCD_VC_puts(VC0, DS0, YES);
	LCD_VC_puts(VC0, DS1, YES);
	LCD_VC_puts(VC0, DS2, YES);
	LCD_VC_puts(VC0, DS3, YES);

#ifdef	__18F8722
	start_pic(PIC_8722); // configure external hardware to the correct startup conditions
#endif
	P.BLANK_LCD = FALSE;
	wdtdelay(10000); // delay for power related LCD setup glitch
	OpenXLCD(FOUR_BIT & LINES_5X7);
	while (BusyXLCD());
	wdtdelay(10000); // delay for power related LCD setup glitch
	OpenXLCD(FOUR_BIT & LINES_5X7);
	while (BusyXLCD());
	WriteCmdXLCD(0xc); // blink, cursor off
	while (BusyXLCD());
	WriteCmdXLCD(0x1); // clear screen
	wdtdelay(10000);
	while (BusyXLCD());

#ifdef	__18F8722
	if (STKPTRbits.STKFUL) {
		putrs2USART("\r\n");
		term_time();
		putrs2USART("\x1b[7m Restart from Stack Full. \x1b[0m\r\n");
		BOOT_STATUS += 1;
		alarms.mbmc_alarm.cpu = 1;
	}
	if (STKPTRbits.STKUNF) {
		putrs2USART("\r\n");
		term_time();
		putrs2USART("\x1b[7m Restart from Stack Underflow. \x1b[0m\r\n");
		BOOT_STATUS += 2;
		alarms.mbmc_alarm.cpu = 1;
	}
#endif

	if (WDT_TO) {
		putrs2USART("\r\n");
		term_time();
		putrs2USART("\x1b[7m Restart from Watchdog Timer. \x1b[0m\r\n");
		BOOT_STATUS += 4;
		alarms.mbmc_alarm.cpu = 1;
	}

	if (EEP_ER) {
		putrs2USART("\r\n");
		term_time();
		putrs2USART("\x1b[7m Possible EEPROM write error. \x1b[0m\r\n");
		BOOT_STATUS += 8;
		alarms.mbmc_alarm.cpu = 1;
	}

	strncpypgm2ram(bootstr2, START1, LCD_W);
	LCD_VC_puts(VC0, DS0, YES);

	putrs2USART(" FW ");
	strncpypgm2ram(bootstr2, build_time, LCD_W);
	LCD_VC_puts(VC0, DS1, YES);
	puts2USART(bootstr2);
	putrs2USART(" ");

	strncpypgm2ram(bootstr2, build_date, LCD_W);
	puts2USART(bootstr2);
	LCD_VC_puts(VC0, DS2, YES);

	strncpypgm2ram(bootstr2, MBMC_VERSION, LCD_W);
	puts2USART(bootstr2);
	putrs2USART("\r\n");
	LCD_VC_puts(VC0, DS3, YES);

	if (WDT_TO || EEP_ER || STKPTRbits.STKFUL || STKPTRbits.STKUNF) {
		STKPTRbits.STKFUL = 0;
		STKPTRbits.STKUNF = 0;
		strncpypgm2ram(bootstr2, BOOT_ALM1, LCD_W);
		LCD_VC_puts(VC0, DS0, YES);
		LCD_VC_puts(VC0, DS1, YES);
		LCD_VC_puts(VC0, DS2, YES);
		LCD_VC_puts(VC0, DS3, YES);
		do {
			ALARMOUT = R_ON;
		} while (STFU);
	}

	term_time();
	sprintf(bootstr2, " Configuration DIPSW %i%i%i%i%i%i%i%i LSB\r\n", DIPSW8, DIPSW7,
		DIPSW6, DIPSW5, DIPSW4, DIPSW3, DIPSW2, DIPSW1);
	puts2USART(bootstr2);

	if (DIPSW2 == HIGH) { // set number of batteries to 2
		battnum = HISTBATTNUM;
	}

	if (DIPSW5 && !DIPSW2) { // hardware GANGED MODE if > 2 batteries
		B_GANGED = TRUE;
		term_time();
		putrs2USART(" Battery 1&2 GANGED mode \r\n");
	} else {
		B_GANGED = FALSE;
	}

	// leds from outputs to ground via resistor.

	hist[B0].ah = 100; // not used
	if (B_GANGED) {
		hist[B1].ah = B12_GANGEDAH;
	} else {
		hist[B1].ah = B1AH; // config battery cap in Ah, 1.0 A units
	}
	hist[B2].ah = B2AH;
	hist[B3].ah = B3AH;
	hist[B4].ah = B4AH;
	term_time();
	putrs2USART(" Configure battery operational data \r\n");
	cell[B0].id = 'N'; /* none */
	cell[B1].id = B1ID;
	cell[B2].id = B2ID;
	cell[B3].id = B3ID;
	cell[B4].id = B4ID;

	for (z = 0; z <= battnum; z++) {
		if (DIPSW1 == HIGH) { // clear battery data
			term_time();
			putrs2USART(" Init Battery Data \r\n");
			cell[z].id = B1ID;
			if (z > 2) {
				write_data_eeprom(B3ID, 5, z, 0);
				cell[z].id = B3ID;
			} else {
				write_data_eeprom(B1ID, 5, z, 0);
			}
		}
		cell[z].voltage = 0;
		cell[z].current = 0;
		cell[z].charge = 0;
		cell[z].cycles = 0;
		cell[z].noload = 0;
		cell[z].date = 0;
		hist[z].rate = (uint16_t) ((float) hist[z].ah * DF); // derate battery by (Discharge Floor) factor
		hist[z].drate = 0; // system adjusted battery Ah offset
		hist[z].rest_rate = 0; // stores energy in Ah than can be recovered by battery rest and other factors
		hist[z].rest_factor = RFACTOR; // Efficency factor of battery recovery
		hist[z].peukert = PerkC1;
		hist[z].peukert_adj = Perk_ADJ_FL;
		hist[z].cef = CEF_HSOC; // cef used for recharge calculations
		hist[z].cef_save = hist[z].cef; // starting cef during recharge cycles
		hist[z].cef_calc = CEF_HSOC; // this value will be updated after a full recharge cycle
		hist[z].h[7] = BATTHIGH;
		hist[z].h[8] = BATTLOW;

		hist[z].h[10] = ESRHIGH;
		cell[z].online = FALSE;
		cell[z].cconline = FALSE;
		cell[z].discharged = FALSE;
		cell[z].dead = FALSE;
		cell[z].critical = FALSE;
		cell[z].fresh = FALSE;
	}
	hist[B2].peukert = PerkC2; // init B2 Peukert factor

	/*              SET primary battery [B1] as the online (power to inverter */
	cell[B1].online = TRUE;

	if (DIPSW1 == HIGH) { // clear and set default eeprom data
		term_time();
		putrs2USART(" Erasing all EEPROM data values\r\n");
		wipe_data_eeprom(1024);
		term_time();
		putrs2USART(" Init ADC Cal EEPROM Data with default values\r\n");
		for (z = 0; z < ADC_SLOTS; z++) {
			write_data_eeprom(adc_cal[z], ADC_SLOTS, z, EEPROM_ADC);
		}
	}

	term_time();
	putrs2USART(" Read battery eeprom data \r\n");

