nsaspook/mbmc/swm8722/solar18f8722/swm8722.c
	/*
	 * load EEPROM data
	 */
	if (read_data_eeprom(0, EEPROM_BAT) == CHECKMARK) { // load battery types from EEPROM
		for (z = 0; z <= battnum; z++) { // 1 + number of batteries, 0 is the controller supply voltage
			eep_char = read_data_eeprom(EEPROM_BAT + 2, z);
			if ((eep_char == 'S') || (eep_char == 'M') || (eep_char == 'L') || (eep_char == 'N')) {
			} else {
				term_time();
				putrs2USART(" Invalid battery type eeprom data \r\n"); // init eeprom data
				write_data_eeprom(cell[z].id, 5, z, EEPROM_BAT);
			}
		}
	} else {
		term_time();
		putrs2USART(" Invalid battery eeprom data \r\n"); // init eeprom data
		for (z = 0; z <= battnum; z++) {
			term_time();
			putrs2USART(" Invalid battery type eeprom data \r\n"); // init eeprom data
			write_data_eeprom(cell[z].id, 5, z, EEPROM_BAT);
		}
	}
	term_time();
	putrs2USART(" Read ADC eeprom data \r\n");

	if (read_data_eeprom(0, EEPROM_ADC) == CHECKMARK) { // load ADC cal data from EEPROM
		term_time();
		putrs2USART(" ADC eeprom data ");
		for (z = 0; z < ADC_SLOTS; z++) {
			adc_cal[z] = read_data_eeprom(EEPROM_ADC + 2, z);
			sprintf(bootstr2, " %i:", (int16_t) adc_cal[z]);
			puts2USART(bootstr2);
		}
		putrs2USART("\r\n");
	} else {
		term_time();
		putrs2USART(" Invalid ADC eeprom data \r\n"); // init adc cal eeprom data												// init eeprom data
		for (z = 0; z < ADC_SLOTS; z++) {
			write_data_eeprom(adc_cal[z], ADC_SLOTS, z, EEPROM_ADC);
		}
	}

	term_time();
	putrs2USART(" Read History eeprom data \r\n");

	if (read_data_eeprom(0, EEPROM_HIS) == CHECKMARK) { // load old history data from EEPROM
		term_time();
		putrs2USART(" History eeprom data ");
		for (z = 0; z <= battnum; z++) {
			tmp8 = read_data_eeprom(EEPROM_HIS + 2, z);
			sprintf(bootstr2, " %x:", (int16_t) tmp8);
			puts2USART(bootstr2);
		}
		putrs2USART("\r\n");
	} else {
		term_time();
		sprintf(bootstr2, " Invalid History eeprom data, size: %i\r\n", (int16_t) sizeof(hist[0].h)); // init eeprom data
		puts2USART(bootstr2);
		for (z = 0; z <= battnum; z++) {
			write_data_eeprom(hist[z].h[11], battnum, z, EEPROM_HIS); // total charge cycles
		}
	}

	if (DIPSW6 == HIGH) { // failsafe mode, connect C40 to battery#1 and loop
		fail_safe();
		while (TRUE); // Don't  continue
	}

	zero_amploc_PV(); // zero input current sensor
	CCOUTOPENSW = R_OFF; // charge voltage relay/on
	if (LOADNOTFAN || !P.COOLING) PVLOAD = R_OFF; // charge load relay/on
	term_time();
	putrs2USART(" Read ADC data inputs \r\n");
	wdttime(BATRUNF);
	ADC_read();

	//              setup SDHC card for datalogging
	if (initsd() != 0) { // init the SDCARD interface.
		sprintf(bootstr2, "SD Card init failed.   ");
		LCD_VC_puts(VC0, DS2, YES);
		sprintf(bootstr2, "No history will be saved!");
		LCD_VC_puts(VC0, DS3, YES);
		term_time();
		putrs2USART(" #### \x1b[7mNo SDCARD Detected, No history will be saved!\x1b[0m ####\r\n");
		alarms.mbmc_alarm.sdcard = 1;
	}

	if ((DIPSW1 == HIGH) || (hist[B1].h[8] == 0) || (hist[B2].h[8] == 0)) { // set default hist and SD data with DIPSW1 or if the h[8] data is invalid
		init_hist_data();
	}

	voltfp(R.inputvoltage, f1);
	voltfp(R.ccvoltage, f2);
	sprintf(bootstr2, "%iBat,%sV,%sV      ", battnum, f1, f2); // display battery ,PV info
	LCD_VC_puts(VC0, DS0, YES);

	sprintf(bootstr2, "DIPSW %i%i%i%i%i%i%i%i LSB          ", DIPSW8, DIPSW7,
		DIPSW6, DIPSW5, DIPSW4, DIPSW3, DIPSW2, DIPSW1);
	LCD_VC_puts(VC0, DS1, YES);

	start_delay();

	BCRELAYS = 0xFF; // turn on all battery relays/on
	PVLOAD = R_ON; // charge load relay on before measuring PV input voltage

	wdttime(BATRUNF); // read battery and charging system voltages
	ADC_read();
	srand((uint16_t) R.systemvoltage); // set random seed
	cell[B0].valid = rand(); // set valid value

	/* Work thread start */
	start_workerthread();

	wdttime(BATRUNF);
	term_time();
	putrs2USART(runcode3);

	/* Loop forever */
	while (TRUE) {
		if (P.PRIPOWEROK) {
			BCRELAYS = 0xFF; // turn off all battery relays
			wdttime(BATRUNF); // read battery and charging system voltages

			mkbsstring();
			update_hist();

			// set battery number 0=battery array, controller batteries check
			cell[B0].voltage = R.systemvoltage;
			cell[B0].noload = R.systemvoltage;
			cell[B0].charge = R.ccvoltage;
			cell[B0].cycles++;
			if (cell[B0].voltage < BATTSYSLOW) P.BCHECK = TRUE; // check array for low voltage

			for (z = 1; z <= battnum; z++) {
				if (cell[B0].voltage < BATTSYS) cell[z].critical = TRUE; // set battery as critical if the whole array is failing
				if (cell[z].valid == cell[B0].valid) {
					update_hist();
					voltfp(cell[z].charge, f1);
					sprintf(bootstr2, "B%i %sV                   ", z, f1);
					LCD_VC_puts(VC0, DS0, YES);
					voltfp(cell[z].noload, f1);
					voltfp(cell[z].voltage, f2);
					sprintf(bootstr2, "ul %sV,tl %sV          ", f1, f2);
					LCD_VC_puts(VC0, DS1, YES);
					wdttime(BATRUNF);
				}
			}

			ftest++;
		} else {
			idle_loop();
			update_hist();
			bn = pick_batt(NO, NULL0);
			if (P.SYSTEM_STABLE) noload_soc();
		}

		if (ftest > BATTCHECK) { // force battery test after X loops
			if (R.inputvoltage > SOLARHIGH) P.BCHECK = TRUE;
			ftest = 0;
		}

		if (!P.PRIPOWEROK) { // skip if we are in primary battery override charging.
			sprintf(bootstr2, "OVERRIDE CHRG #1");
			LCD_VC_puts(VC0, DS0, YES);
		}
		sprintf(bootstr2, "                        "); //      blank second line
		LCD_VC_puts(VC0, DS1, YES);

		wdttime(BATRUNF);
		ADC_read();
		while ((R.inputvoltage > SOLARHIGH) || P.BCHECK) {

			if (P.BCHECK) {
				for (z = 1; z <= battnum; z++) {
					if (P.PRIPOWEROK) {
						if (P.SET_CEF) update_cef(z, P.SET_CEF); // check cef before we start charging
						term_time();
						sprintf(bootstr2, " Battery %i BC ", z);
						puts2USART(bootstr2);
						putrs2USART(runcode2);
						wdttime(BATRUNF);
						mkbsstring();
						bn = z; // set battery #
						ChargeBatt(bn, TRUE, TRUE); //      check battery
						update_hist();
					}
				}
				if (!P.SYSTEM_STABLE) {
					noload_soc(); //	Setup soc on startup after ESR checks
				}
			}
			P.BCHECK = FALSE;
			P.SET_CEF = FALSE;

			P.SYSTEM_STABLE = TRUE; // we can start monitor logic now

