nsaspook/mbmc/swm8722/solar18f8722/swm8722.c
			s_crit(HL); // reload_cal adc values into ram from eeprom
			if (read_data_eeprom(0, 8) == CHECKMARK) { // load ADC cal data from EEPROM
				for (z = 0; z < ADC_SLOTS; z++) {
					adc_cal[z] = read_data_eeprom(10, z);
				}
			}
			e_crit();

			noload_soc(); // run both twice to get stable data
			noload_soc();
			pick_batt(NO, NULL0);
			update_hist();

			if (P.PRIPOWEROK) {
				sprintf(bootstr2, "Any critical      ");
				LCD_VC_puts(VC0, DS0, YES);
				sprintf(bootstr2, "Batteries?              ");
				LCD_VC_puts(VC0, DS1, YES);

				for (z = 1; z <= battnum; z++) {
					pick_batt(NO, NULL0);
					update_hist();
					sprintf(bootstr2, "Battery #%i          ", z);
					LCD_VC_puts(VC0, DS1, YES);
					mkbsstring();

					if (cell[z].critical) {
						wdttime(BATRUNF);
						if ((R.inputvoltage > SOLARHIGH)) {
							term_time();
							putrs2USART(runcode4);
							bn = z; // set battery #
							hist[bn].h[5]++; // full discharge cycles, will also update B2 when ganged
							if ((z == B2) && B_GANGED) {
								term_time();
								sprintf(bootstr2, " Battery %2i,  \x1b[7mGANGED to B1\x1b[0m \n\r", z);
								puts2USART(bootstr2);
								bn = B1;
							}
							noload_soc();
							ChargeBatt(bn, FALSE, TRUE);
							noload_soc();
							ChargeBatt(bn, TRUE, TRUE);
							ftest = BATTCHECK;
							ALARMOUT = R_OFF; // turn off relay
						}
					}
				}
			}

			if (P.PRIPOWEROK && (R.inputvoltage > SOLARHIGH)) {
				sprintf(bootstr2, "Any discharged        ");
				LCD_VC_puts(VC0, DS0, YES);
				sprintf(bootstr2, "Batteries?           ");
				LCD_VC_puts(VC0, DS1, YES);
				wdttime(BATRUNF);
				sprintf(bootstr2, "---------------------");
				LCD_VC_puts(VC0, DS1, YES);

				ftest = 0;

				do {
					idle_loop();
					update_hist();
					bn = pick_batt(NO, NULL0);
					noload_soc();
					bn = pick_batt(battnum + 1, NULL0); // again to recheck for valid data
					boi = 0;
					if (cell[B1].online) boi = B1;
					if (cell[B2].online) boi = B2;
					if (bn != pick_batt(NO, NULL0)) bn = pick_batt(battnum + 1, NULL0); // double check

					if ((bn == B0) && (CCMODE == FLOAT_M)) {
						sprintf(bootstr2, "Battery #1 Float charge          ", bn);
						LCD_VC_puts(VC0, DS0, YES);
					} else {
						if (bn == B0) bn = boi; // try to make charger to to float on boi
						sprintf(bootstr2, "Battery #%i Full charge         ", bn);
						LCD_VC_puts(VC0, DS0, YES);
					}

					mkbsstring();
					wdttime(BATRUNF);
					ADC_read();
					if ((R.inputvoltage > SOLARHIGH)) {
						if ((bn == B0) && (CCMODE == FLOAT_M)) {
							voltfp(R.inputvoltage, f1);
							voltfp(R.ccvoltage, f2);
							ahfp(R.currentin, f3);
							sprintf(bootstr2, "P%s,B%s,%sA           ", f1, f2, f3);
							LCD_VC_puts(VC0, DS1, YES);

							if (BMMODE != FLOAT_M) {
								ChargeRelayOn(1, TRUE);
								BMMODE = FLOAT_M;
							}
						} else {
							term_time();
							putrs2USART(runcode5);
							BMMODE = CHARGE_M;

							ChargeBatt(bn, FALSE, TRUE);
							noload_soc();

							ChargeBatt(bn, TRUE, TRUE);
						}
					}
					ftest++;
					sprintf(bootstr2, "Battery #%i Exit       ", bn);
					LCD_VC_puts(VC0, DS0, YES);

					for (z = 1; z <= battnum; z++) {
						if (P.PRIPOWEROK) {
							if (P.SET_CEF) update_cef(z, P.SET_CEF); // check cef before we start charging
							bn = z; // set battery #
							ChargeBatt(bn, TRUE, TRUE); // check battery
							noload_soc(); // Setup soc on retesting
							update_hist();
						}
					}

					bn = pick_batt(NO, NULL0);
					if (bn != pick_batt(NO, NULL0)) bn = 0; // double check
				} while ((bn == B0) && (ftest < BFTEST)); // try to stay in this loop if floating
			}
			zero_amploc_PV(); // reset input sensor zero

			if (ftest++ >= BATTCHECK) { // force battery test after X loops
				//                                BCHECK = TRUE;
				ftest = 0;
			}
			term_time();
			putrs2USART(runcode10);
			wdttime(BATRUNF);
			for (z = 1; z <= battnum; z++) {
				if (cell[z].valid == cell[B0].valid) {
					noload_soc();
					update_hist();
					if (!P.PRIPOWEROK) {
						sprintf(bootstr2, "OVERRIDE CHRG #1");
						LCD_VC_puts(VC0, DS2, YES);

						mkbsstring(); // update primary battery voltage
						cell[B1].voltage = R.primarypower[B1]; // update cell[1] voltages for display and status
						cell[B1].noload = R.primarypower[B1];
						wdttime(BATRUNF);
					}
					voltfp(cell[z].charge, f1);
					sprintf(bootstr2, "B%i %sV                   ", z, f1);
					LCD_VC_puts(VC0, DS0, YES);

					voltfp(cell[z].noload, f1);
					voltfp(cell[z].voltage, f2);
					sprintf(bootstr2, "ul %sV,tl %sV          ", f1, f2);
					LCD_VC_puts(VC0, DS1, YES);

					if (cell[z].dead) {
						alarm_buffer[almctr].bn = z;
						alarm_buffer[almctr++].alm_num = 9;
						alarm_codes.alm_flag = TRUE;
						check_alarm(z, " main1 "); // possible dead battery
						battalarm(0, z, 0);
						cell[z].dead = FALSE;
						cell[z].critical = TRUE;
						dead_times++;
					}
					wdttime(BATRUNF);
				}
			}
			wdttime(BATRUNF);
			ADC_read();
		}

		s_crit(HL);
		waittime = V.timerint_count;
		e_crit();
		term_time();
		putrs2USART(runcode0);
		wdttime(BATRUNF);

		while (R.inputvoltage < SOLARLOW) { // wait until we have charging power
			solarup_delay = NULL0;
			idle_loop();
			check_alarm(CCS.boi, " main2 "); // send alarm codes to terminal if alm_flag is set
			sprintf(bootstr2, "Charge Power Low        ");
			LCD_VC_puts(VC0, DS0, YES);

			voltfp(R.inputvoltage, f1);
			voltfp(R.ccvoltage, f2);
			sprintf(bootstr2, "%s,%s %s               ", f1, f2, hms(((V.timerint_count - waittime))));
			LCD_VC_puts(VC0, DS1, YES);

			wdttime(BATRUNF);
			mkbsstring(); // update
			P.BCHECK = TRUE;
			ftest = 0;
			if (P.SYSTEM_STABLE && (((R.primarypower[CCS.boi] < BATTFLAT)
				&& (R.primarypower[CCS.boi] > BATTCRIT))
				&& (cell[CCS.boi].valid == cell[B0].valid))) { // check for low B1
				if (P.PRIPOWEROK) { // went from good to bad
					ALARMOUT = R_ON; // alert for bad power
				}
				//		P.PRIPOWEROK = FALSE; // set software flag and trigger HOUSE power charger/generator
				if (DIPSW4 == HIGH) {
					divert_power(OFF, YES, 0);
					if (R.currentin < CHARGER_MIN) {
						charger_power(ON, NO); // CHARGERL = R_ON; // RB0 is external battery charger/generator relay
						PVLOAD = R_OFF;
						alarm_buffer[almctr].bn = CCS.boc;
						alarm_buffer[almctr++].alm_num = 4;
						alarm_codes.alm_flag = TRUE;
					}
				}
				check_alarm(CCS.boi, " main3 "); // send alarm codes to terminal if alm_flag is set
			}
			noload_soc();
			update_hist();
			pick_batt(NO, NULL0);
			if ((model_update)) {
				model_learn(lmode);
			}
		}
		PVLOAD = R_ON;
		noload_soc();
		update_hist();
		term_time();
		putrs2USART(runcode1);

		ClrWdt(); // reset the WDT timer
	}
}

